{"vocab_mapping": {"the": 237, "nearest": 610, "sketch_poi_type": 688, "is": 132, "sketch_poi": 787, "at": 354, "sketch_address": 336, "would": 903, "you": 332, "like": 522, "directions": 1273, "there": 1120, "?": 1042, "where": 258, "s": 41, "distance": 402, "address": 148, "poi": 64, "it": 1246, "looks": 770, "a": 1112, "road": 846, "block": 541, "being": 813, "reported": 877, "on": 744, "route": 1018, "but": 269, "i": 1093, "will": 549, "still": 477, "find": 703, "quickest": 904, "to": 628, "yes": 396, ",": 443, "please": 62, "set": 550, "via": 768, "that": 919, "avoids": 568, "all": 1003, "if": 1000, "possible": 751, "are": 228, "very": 1078, "welcome": 130, "!": 285, "": 478, "thanks": 980, "so": 418, "much": 1096, "for": 895, "your": 126, "help": 1086, "sketch_distance": 43, "away": 180, "located": 151, "through": 916, "sketch_traffic_info": 1261, "what": 850, "anytime": 731, "closest": 710, "show": 1123, "me": 1167, "location": 116, "can": 40, "get": 102, "chinese": 1244, "food": 1211, "with": 1183, "only": 1165, "noted": 373, "ok": 557, "give": 752, "an": 680, "and": 199, "drive": 517, "safely": 685, "enjoy": 101, "thank": 483, "have": 72, "good": 923, "time": 695, "hi": 604, "up": 581, "reminder": 60, "my": 479, "sketch_event": 864, "sketch_time": 1019, "sketch_party": 114, "who": 208, "date": 608, "party": 537, "event": 1163, "okay": 301, "perfect": 14, "when": 386, "schedule": 936, "put": 430, "calendar": 173, "sketch_date": 671, "weather": 1134, "this": 375, "sketch_weekly_time": 361, "be": 22, "sketch_weather_attribute": 74, "sketch_temperature": 892, "highest": 560, "day": 1047, "check": 606, "forecast": 198, "high": 946, "low": 288, "sketch_location": 1281, "no": 466, "not": 1213, "gonna": 68, "in": 256, "over": 417, "next": 328, "2": 456, "days": 270, "raining": 367, "car": 87, "do": 633, "want": 273, "know": 852, "of": 211, "excellent": 137, "helpful": 1056, "city": 1132, "need": 669, "shopping": 275, "mall": 1063, "reach": 316, "sounds": 252, "great": 170, "setting": 756, "work": 1011, "sketch_room": 1271, "remind": 769, "nearby": 20, "coffee": 986, "shops": 282, "which": 1260, "collision": 324, "try": 476, "take": 723, "fastest": 634, "available": 1146, "four": 271, "scheduled": 1219, ";": 209, "one": 65, "john": 667, "coming": 1085, "room": 547, "agenda": 422, "should": 1186, "going": 759, "expected": 876, "temperature": 1272, "glad": 53, "could": 1133, "assistance": 189, "class": 505, "kindly": 1040, "right": 1179, "now": 103, "shouldn": 457, "t": 649, "any": 755, "during": 1001, "seven": 1216, "scheduling": 11, "pleasure": 590, "sorry": 1119, "appears": 698, "shortest": 1028, "send": 696, "sent": 909, "map": 1195, "pick": 49, "listing": 120, "fast": 947, "places": 1236, "more": 893, "info": 395, "restaurant": 1180, "sure": 363, "pizza": 956, "place": 1250, "within": 260, "ve": 663, "already": 333, "navigator": 920, "go": 143, "nextt": 6, "attending": 705, "shall": 868, "upcoming": 1151, "chance": 452, "problem": 686, "both": 98, "they": 376, "none": 2, "has": 1170, "least": 327, "amount": 701, "traffic": 887, "moment": 964, "we": 1060, "from": 842, "navigation": 76, "keen": 219, "alright": 718, "way": 1203, "screen": 1090, "then": 369, "let": 622, "inquiring": 39, "about": 38, "showing": 589, "skies": 1194, "tell": 925, "medicine": 493, "anything": 611, "else": 1242, "roadblock": 815, "without": 673, "m": 1044, "option": 733, "range": 1025, "around": 467, "slightly": 873, "longer": 55, "allow": 578, "faster": 670, "house": 1266, "does": 267, "friend": 782, "live": 894, "ll": 1012, "carefully": 1155, "listed": 48, "gps": 454, "desiring": 1045, ":": 236, "search": 801, "hotels": 509, "near": 1182, "alternate": 240, "did": 450, "assistant": 1, "make": 433, "call": 1016, "area": 461, "destination": 566, "uhh": 785, "well": 80, "park": 138, "or": 298, "prefer": 913, "actually": 571, "another": 18, "shop": 844, "just": 832, "two": 1168, "miles": 939, "called": 264, "bud": 583, "details": 1267, "add": 111, "discuss": 540, "company": 383, "picnic": 739, "our": 707, "these": 1176, "papa": 861, "tonight": 406, "4": 1175, "50pm": 1259, "attach": 586, "10": 1269, "minutes": 1243, "before": 555, "hand": 955, "3": 319, "say": 845, "specific": 480, "entire": 432, "trip": 29, "predicted": 773, "am": 694, "really": 863, "appointment": 424, "name": 749, "happy": 1232, "lined": 677, "dad": 1128, "out": 1215, "supposed": 1100, "interested": 543, "here": 33, "position": 1030, "pain": 225, "navigate": 1122, "its": 508, "how": 155, "other": 629, "those": 1204, "quick": 1009, "information": 174, "hope": 184, "too": 1279, "won": 1081, "rainy": 97, "been": 229, "see": 154, "aug": 325, "august": 750, "serving": 210, "planned": 404, "little": 1227, "48": 419, "hours": 967, "wide": 821, "conditions": 998, "-": 645, "particular": 862, "weekly": 754, "looking": 485, "wanting": 352, "predicts": 738, "immediately": 1088, "fine": 783, "predict": 1249, "three": 1049, "first": 556, "last": 1206, "goodbye": 778, "hear": 140, "7": 338, "lows": 1158, "20s": 96, "highs": 262, "60": 914, "avoid": 414, "awesome": 1149, "got": 652, "fantastic": 429, "eye": 294, "feel": 343, "some": 573, "closer": 722, "options": 587, "peets": 337, "game": 944, "playing": 220, "tenth": 687, "month": 712, "correct": 672, "sound": 226, "able": 743, "anyway": 254, "direct": 784, "preferably": 1046, "updated": 323, "navigating": 118, "soon": 553, "fall": 1202, "confirm": 1083, "quarterly": 482, "report": 1026, "best": 357, "wish": 730, "otherwise": 881, "isn": 415, "predictions": 445, "several": 960, "cities": 927, "something": 525, "sending": 5, "mmm": 664, "patience": 1136, "note": 599, "oh": 659, "start": 614, "same": 831, "parties": 51, "joining": 858, "named": 765, "night": 436, "sketch_agenda": 917, "future": 554, "local": 1154, "tea": 1031, "current": 283, "fog": 23, "along": 181, "doesn": 286, "sir": 235, "between": 1091, "by": 966, "few": 1209, "providing": 207, "follow": 57, "error": 609, "test": 315, "data": 793, "en": 848, "assitant": 499, "plot": 329, "driver": 824, "update": 440, "asking": 1221, "clear": 825, "couple": 54, "listings": 1217, "eat": 511, "safe": 201, "hotel": 942, "palo": 675, "alto": 1214, "garage": 890, "stanford": 1147, "oval": 931, "chosen": 714, "arrive": 836, "shortly": 867, "prescription": 510, "later": 253, "pills": 1233, "stay": 1055, "suggest": 503, "enter": 115, "purpose": 1048, "as": 1159, "he": 214, "was": 1196, "his": 501, "business": 1111, "meaning": 971, "might": 81, "lose": 623, "lot": 347, "currently": 1191, "wanted": 760, "aware": 600, "guess": 19, "5671": 1024, "barringer": 145, "street": 683, "miss": 245, "most": 889, "fill": 442, "display": 172, "making": 231, "hello": 693, "him": 591, "bring": 1142, "friends": 251, "100fs": 700, "serves": 104, "calls": 795, "wind": 1113, "bunch": 1278, "temperatures": 42, "alternative": 388, "quicker": 7, "also": 1095, "chicago": 1064, "especially": 843, "laboratory": 166, "request": 1109, "discussing": 941, "dress": 567, "code": 83, "results": 465, "tomorrows": 1130, "parking": 458, "spot": 1288, "though": 1053, "locations": 221, "works": 289, "each": 878, "50s": 929, "reaching": 993, "?!": 489, "displaying": 518, "once": 551, "again": 1205, "unfortunately": 171, "different": 59, "don": 234, "found": 1061, "worry": 506, "forget": 857, "remember": 869, "preference": 1275, "d": 1189, "close": 1102, "ravenswood": 933, "104": 75, "thrusday": 248, "done": 377, "29th": 1008, "outside": 1241, "grocery": 516, "market": 215, "ugh": 702, "store": 492, "expect": 439, "testing": 530, "certain": 888, "269": 676, "alger": 495, "visit": 185, "snowing": 1251, "rock": 513, "philzis": 13, "weeks": 533, "afraid": 779, "pull": 1094, "lives": 351, "far": 186, "enough": 1177, "retrieve": 514, "whole": 397, "lessons": 139, "list": 52, "reminders": 953, "mom": 484, "pizzeria": 448, "nope": 410, "highlighted": 317, "lost": 912, "kidding": 1038, "activites": 45, "while": 36, "avoiding": 757, "picked": 840, "assist": 934, "schedules": 437, "signing": 100, "nda": 617, "additional": 86, "needing": 655, "alarm": 408, "locate": 370, "homes": 764, "wrong": 35, "aren": 405, "vary": 113, "40s": 320, "wonderful": 713, "thusday": 640, "atheron": 798, "forecasts": 455, "groceries": 682, "819": 921, "alma": 1240, "dr": 502, "dinners": 1103, "minimum": 1276, "nearer": 193, "bye": 994, "welcone": 296, "directing": 353, "pic": 134, "cup": 1235, "mandarin": 364, "4f": 1284, "shows": 859, "alternately": 56, "buy": 182, "cool": 1037, "ouch": 874, "dates": 777, "needed": 820, "times": 1258, "choice": 726, "childrens": 775, "less": 1245, "presently": 427, "may": 488, "back": 63, "seems": 1153, "finding": 642, "december": 910, "buddy": 112, "their": 1137, "776": 1127, "arastradero": 344, "play": 99, "however": 725, "confused": 1114, "worried": 217, "l": 1041, "o": 995, "w": 1263, "y": 879, "exact": 812, "heading": 727, "recorded": 965, "didn": 856, "ask": 127, "starving": 109, "12pm": 30, "shot": 651, "highlight": 519, "using": 371, "proceed": 24, "tired": 494, "added": 342, "budget": 1115, "snowy": 981, "group": 25, "look": 1105, "probably": 772, "either": 162, "since": 950, "than": 699, "alrigth": 1020, "cafe": 800, "ventia": 616, "random": 1097, "ice": 394, "fastes": 987, "doing": 930, "repetitive": 124, "job": 621, "70fs": 975, "domino": 957, "menlo": 125, "parl": 497, "appreciate": 381, "use": 1222, "exercise": 471, "100": 28, "calling": 735, "50": 970, "outlook": 243, "full": 1052, "practice": 205, "feeling": 46, "care": 989, "00am": 71, "102": 159, "activity": 203, "covers": 272, "2am": 1054, "&": 943, "5": 668, "reiterate": 1107, "events": 190, "takeout": 804, "attendance": 136, "speak": 391, "5672": 809, "direction": 241, "mapping": 108, "exactly": 58, "marked": 246, "taking": 761, "provide": 940, "271": 988, "springer": 66, "st": 1193, "learning": 690, "them": 546, "closet": 1106, "fact": 1218, "im": 105, "son": 392, "nice": 882, "predicting": 674, "happening": 520, "talking": 362, "choose": 1033, "even": 817, "specifically": 1252, "come": 481, "awful": 1171, "wanna": 594, "refill": 278, "helping": 638, "willow": 829, "match": 349, "tho": 403, "locally": 719, "blood": 431, "lowest": 569, "temperture": 500, "434": 654, "arastraero": 572, "desire": 720, "italian": 123, "style": 736, "espresso": 789, "clouds": 819, "although": 985, "better": 1255, "830": 523, "almanor": 358, "lane": 823, "long": 37, "trying": 627, "always": 781, "sleep": 961, "double": 833, "her": 841, "nor": 192, "anyone": 766, "thre": 374, "everything": 168, "short": 716, "plotting": 366, "gas": 12, "calculate": 224, "says": 312, "prediction": 1059, "forecasted": 78, "mix": 340, ">": 1188, "said": 409, "exceptions": 179, "quickly": 973, "despite": 1160, "plan": 711, "thats": 1210, "drizzling": 334, "mean": 849, "placing": 660, "12": 570, "service": 748, "farther": 1135, "requested": 305, "items": 737, "ready": 1014, "whenever": 1082, "10pm": 277, "central": 728, "tooth": 963, "pulled": 636, "motels": 1143, "22nd": 1145, "50sf": 1075, "cloudiness": 818, "states": 266, "warmest": 1051, "starts": 472, "understood": 790, "knowing": 197, "heads": 434, "seeking": 1225, "held": 4, "second": 534, "stereo": 807, "\"": 732, "nothing": 200, "matters": 802, "music": 67, "meantime": 469, "open": 1257, "whats": 167, "executive": 928, "40": 1207, "20": 88, "purchase": 648, "maybe": 708, "coordinates": 444, "startbucks": 885, "vaccination": 1077, "hunger": 635, "reminded": 990, "ahead": 839, "sue": 962, "empty": 1208, "22and": 632, "blizzards": 1265, "ever": 1138, "drizzles": 295, "saurday": 122, "average": 838, "fahrenheit": 335, "started": 1200, "memory": 563, "lesson": 729, "outcast": 548, "pf": 291, "chans": 1264, "seeing": 355, "together": 1139, "rest": 470, "100s": 512, "hailing": 268, "/": 21, "waste": 1092, "ones": 1035, "lighter": 95, "cleat": 300, "sells": 678, "tueday": 1131, "wow": 490, "directionsome": 384, "third": 1283, "sometime": 972, "trough": 1148, "solves": 577, "!\\": 542, "214": 575, "select": 899, ".,": 420, "mist": 774, "period": 1198, "certainly": 460, "unable": 1164, "state": 827, "lunch": 326, "experience": 426, "fairly": 619, "beginning": 679, "end": 161, "warmer": 73, "noooooooo": 880, "somewhere": 1254, "stuck": 398, "relax": 991, "asap": 866, "careful": 896, "9pm": 84, "soonest": 806, ":),": 178, "mind": 1072, "reports": 1277, "doesnt": 828, "appear": 1099, "relevant": 771, "us": 1023, "70s": 605, "medication": 70, "somewhat": 697, "indications": 119, "30": 1274, "many": 891, "cost": 830, "wait": 794, "329": 1199, "el": 1229, "camino": 158, "rea": 763, "climate": 255, "begin": 515, "2opm": 662, "forcast": 579, "marta": 297, "starve": 630, "because": 1197, "trust": 665, "regret": 552, "gasoline": 618, "wold": 907, "jacks": 206, "90s": 797, "followed": 984, "meet": 816, "serve": 360, "kill": 1201, "wirth": 212, "yo": 183, "march": 580, "30s": 293, "hungry": 9, "involved": 387, "promptly": 498, "clarify": 1087, "afternoon": 94, "think": 796, "phils": 1178, "routes": 637, "starbuck": 188, "56": 411, "caldwell": 593, "[": 758, "conversation": 247, "]": 196, "travel": 734, "swim": 992, "bet": 1125, "heavy": 745, "wet": 977, "misspoken": 886, "45": 564, "morning": 997, "whichever": 524, "trouble": 1050, "turn": 780, "watch": 299, "ranges": 847, "mid": 1237, "70": 528, "80s": 871, "meds": 1074, "games": 1181, "wed": 345, "into": 1027, "suffice": 959, "bro": 762, "hour": 400, "neither": 661, "plotted": 932, "traveler": 31, "lodge": 983, "referring": 1230, "mark": 650, "fresco": 135, "routh": 133, "chanel": 441, "vote": 870, "chicken": 900, "orange": 647, "shrimps": 15, "nuts": 535, "july": 382, "saved": 160, "enroute": 3, "program": 142, "children": 902, "health": 799, "foods": 263, "issue": 164, "pass": 1129, "vp": 346, "mine": 446, "greatly": 602, "include": 1238, "eventually": 612, "dental": 1126, "30pm": 607, "accident": 507, "types": 937, "promising": 715, "moderate": 1239, "amounts": 1039, "encounter": 350, "secheduled": 423, "people": 27, "among": 538, "hai": 1089, "wdnesday": 905, "response": 625, "repeat": 855, "frosty": 531, "20fs": 496, "displayed": 576, "advised": 348, "adddress": 666, "880": 1187, "ames": 1066, "whose": 786, "addres": 753, "483": 259, "alester": 447, "ave": 249, "wondering": 194, "coupe": 792, "fun": 257, "mount": 721, "view": 85, "rsvp": 1262, "responded": 1118, "acceptable": 156, "deal": 77, "mostly": 582, "coupas": 157, "free": 1173, "cars": 147, "123": 1192, "elm": 1002, "shoot": 202, "kind": 1185, "hurry": 303, "sunny": 468, "approximately": 91, "shots": 359, "ya": 233, "agree": 438, "seriously": 746, "storms": 401, "goes": 681, "moms": 1287, "april": 491, "2017": 232, "thurs": 948, "receive": 82, "whoever": 8, "lets": 976, "down": 265, "sweet": 853, "session": 860, "getting": 1174, "nowy": 1079, "such": 372, "plans": 1280, "00pm": 803, "falling": 1073, "lots": 592, "heard": 865, "driving": 565, "864": 656, "alamanor": 684, "given": 1010, "searched": 901, "instead": 389, "welcoem": 558, "programmed": 413, "picking": 1015, "above": 1005, "86": 641, "degrees": 459, "impending": 1021, "course": 539, "san": 834, "fancisco": 313, "sensibly": 390, "lower": 1068, "coldest": 646, "westin": 653, "giving": 304, "finally": 1234, "listening": 1231, "hit": 16, "mappling": 281, "somehow": 1101, "million": 814, "head": 974, "likely": 117, "carefull": 596, "reached": 230, "super": 969, "hhumid": 875, "suday": 238, "171": 1256, "oak": 1162, "reservations": 176, "load": 449, "classes": 1029, "anyt": 32, "towards": 311, "60s": 146, "storming": 191, "merger": 883, "accomplish": 1220, "fasest": 1067, "yor": 615, "putting": 144, "sit": 968, "drink": 1043, "fasted": 93, "big": 996, "apple": 1108, "guide": 626, "783": 1223, "arcadia": 935, "pi": 149, "storm": 1069, "must": 504, "drunk": 742, "traveling": 128, "series": 280, "ups": 1270, "downs": 1172, "confirmed": 475, "22th": 747, "iniglewood": 473, "coffe": 908, "rather": 292, "express": 574, "p": 69, "f": 1013, "chang": 689, "gather": 532, "slight": 153, "trader": 365, "joe": 150, "wild": 822, "news": 631, "joint": 982, "347": 1084, "alta": 854, "mesa": 1247, "further": 308, "5677": 1117, "southwest": 624, "evening": 897, "checking": 724, "standford": 474, "648": 639, "amherst": 1034, "ahlambra": 603, "=": 1076, "private": 1098, "radio": 309, "rhank": 131, "chances": 741, "scattered": 545, "including": 129, "barista": 306, "downtown": 808, "(": 658, ").": 227, "respectively": 44, "helps": 529, "potential": 1036, "workout": 110, "1": 915, "satisfy": 1057, "system": 393, "previsions": 487, "love": 906, "malls": 152, "liked": 951, "identical": 26, "ingelwood": 1224, "human": 331, "90": 463, "bathroom": 1286, "!!": 811, "altherton": 851, "massage": 318, "seat": 239, "broken": 1150, "activate": 223, "uff": 407, ")": 421, "headed": 1169, "closeest": 585, "463": 1152, "wil": 165, "gathering": 657, "pronto": 244, "reporting": 1190, "slow": 218, "hacienda": 1228, "insert": 451, "invited": 1248, "jing": 356, "jang": 938, "having": 34, "new": 704, "loved": 92, "yelp": 1022, "welsome": 559, "you1": 999, "panda": 321, "chef": 767, "chu": 805, "detours": 643, "avalible": 1006, "preferred": 898, "needs": 339, "scedule": 613, "90fs": 213, "changing": 486, "pulling": 1166, "distracted": 17, "focus": 216, "probability": 884, "regarding": 562, "actual": 872, "possibly": 89, "everyday": 314, "except": 706, "ive": 826, "teh": 740, "running": 121, "choices": 918, "dicu": 1161, "until": 597, "nooo": 1007, "clothes": 958, "amazing": 1141, "removed": 644, "adding": 380, "mountianview": 561, "wearther": 776, "varies": 261, "adress": 322, "whom": 379, "includes": 791, "areas": 378, "produce": 284, "stand": 544, "probem": 385, "n": 453, "man": 464, "warn": 412, "satruday": 187, "terrific": 692, "jones": 141, "contain": 106, "follows": 287, "ranging": 709, "reservation": 526, "boys": 175, "girl": 368, "dose": 341, "original": 428, "ther": 163, "run": 588, "maping": 435, "jong": 1253, "tio": 1140, "valeros": 169, "accompanying": 1268, "chrildrens": 1184, "of20f": 945, "heat": 595, "\",": 1157, "beside": 691, "\\": 584, "bad": 922, "office": 10, "point": 61, "person": 279, "pm": 1065, "thankyou": 717, "multiple": 924, "),": 302, "sort": 954, "gover": 911, "reserve": 399, "made": 416, "mainly": 1124, "daughter": 204, "understand": 107, "reminding": 274, "11": 1080, "9": 1226, "00": 195, "extremely": 979, "shown": 1058, "ravenwood": 1144, "drom": 1070, "traders": 1071, "fastesr": 527, "present": 1121, "infrastructure": 620, "keep": 1110, "eyes": 1116, "....": 1062, "light": 307, "feed": 90, "siri": 810, "replace": 1004, "8": 949, "speed": 79, "fair": 952, "calender": 521, "humidity": 276, "cloud": 1285, "cover": 290, "collison": 926, "delay": 536, "arrival": 310, "following": 1156, "restaraunt": 425, "plese": 177, "woud": 462, "$STOP$": 222, "$PAD$": 50, "$UNK$": 601, "$TAG$": 835, "$u": 47, "$s": 1017, "$1": 788, "$2": 330, "$3": 837, "$4": 1212, "$5": 1032, "$6": 1282, "parking_garage": 1567, "dish_parking": 1437, "550_alester_ave": 1487, "2_miles": 1551, "traffic_info": 1538, "road_block_nearby": 1317, "poi_type": 1602, "6_miles": 1549, "no_traffic": 1330, "610_amarillo_ave": 1380, "stanford_oval_parking": 1512, "4_miles": 1387, "car_collision_nearby": 1590, "grocery_store": 1533, "409_bollard_st": 1406, "willows_market": 1467, "moderate_traffic": 1600, "rest_stop": 1530, "329_el_camino_real": 1535, "the_westin": 1327, "1_miles": 1328, "heavy_traffic": 1594, "friends_house": 1569, "580_van_ness_ave": 1322, "toms_house": 1438, "pizza_restaurant": 1461, "915_arbol_dr": 1407, "pizza_chicago": 1338, "gas_station": 1351, "200_alester_ave": 1386, "valero": 1350, "chinese_restaurant": 1388, "271_springer_street": 1301, "mandarin_roots": 1449, "76": 1354, "shopping_center": 1561, "383_university_ave": 1504, "town_and_country": 1468, "91_el_camino_real": 1374, "773_alger_dr": 1442, "stanford_shopping_center": 1495, "3_miles": 1348, "coffee_or_tea_place": 1304, "145_amherst_st": 1293, "teavana": 1452, "776_arastradero_rd": 1426, "dominos": 1416, "481_amaranta_ave": 1307, "palo_alto_garage_r": 1334, "5_miles": 1396, "hospital": 1320, "214_el_camino_real": 1339, "stanford_express_care": 1475, "611_ames_ave": 1300, "palo_alto_medical_foundation": 1324, "p_._f_._changs": 1439, "669_el_camino_real": 1460, "434_arastradero_rd": 1532, "ravenswood_shopping_center": 1359, "8_miles": 1575, "593_arrowhead_way": 1316, "chef_chu_s": 1390, "home": 1542, "5671_barringer_street": 1385, "583_alester_ave": 1337, "philz": 1474, "dinner": 1444, "the_11th": 1294, "4pm": 1404, "sister": 1604, "7pm": 1433, "jon": 1510, "the_8th": 1319, "aunt": 1465, "dentist_appointment": 1443, "10am": 1368, "saturday": 1540, "marie": 1302, "taking_medicine": 1587, "5pm": 1564, "monday": 1352, "alex": 1314, "football_activity": 1480, "the_4th": 1490, "yoga_activity": 1464, "the_13th": 1496, "father": 1526, "lab_appointment": 1481, "sunday": 1423, "2pm": 1411, "week": 1342, "hail": 1518, "rain": 1580, "thursday": 1378, "lowest_temperature": 1541, "20f": 1429, "90f": 1544, "hot": 1341, "new_york": 1356, "weather_attribute": 1519, "stormy": 1577, "70f": 1484, "manhattan": 1435, "50f": 1343, "tuesday": 1543, "cloudy": 1588, "40f": 1382, "wednesday": 1297, "clear_skies": 1488, "60f": 1355, "friday": 1310, "windy": 1466, "snow": 1508, "30f": 1572, "overcast": 1527, "camarillo": 1447, "100f": 1483, "frost": 1329, "80f": 1497, "blizzard": 1476, "dry": 1326, "menlo_park": 1289, "warm": 1395, "foggy": 1333, "corona": 1421, "seattle": 1366, "drizzle": 1399, "grand_rapids": 1377, "danville": 1318, "misty": 1451, "san_jose": 1298, "los_angeles": 1469, "durham": 1371, "dew": 1346, "humid": 1534, "san_francisco": 1336, "boston": 1292, "highest_temperature": 1462, "cleveland": 1565, "brentwood": 1445, "inglewood": 1552, "mountain_view": 1562, "compton": 1397, "today": 1491, "oakland": 1524, "san_mateo": 1323, "alhambra": 1448, "atherton": 1557, "tomorrow": 1523, "redwood_city": 1528, "exeter": 1420, "792_bedoin_street": 1499, "starbucks": 1505, "certain_address": 1364, "5677_springer_street": 1394, "452_arcadia_pl": 1290, "safeway": 1563, "578_arbol_dr": 1546, "hotel_keen": 1349, "meeting": 1414, "the_12th": 1478, "conference_room_100": 1517, "peets_coffee": 1470, "110_arastradero_rd": 1400, "papa_johns": 1431, "113_arbol_dr": 1325, "jing_jing": 1305, "819_alma_st": 1566, "whole_foods": 1482, "9981_archuleta_ave": 1436, "the_5th": 1576, "the_10th": 1393, "the_16th": 1554, "football": 1545, "the_7th": 1597, "6pm": 1315, "conference_room_50": 1500, "sign_the_nda": 1432, "1pm": 1458, "the_15th": 1389, "management": 1360, "9am": 1347, "jeff": 1506, "doctor_appointment": 1539, "3pm": 1573, "martha": 1581, "fresno": 1537, "alameda": 1308, "the_3rd": 1367, "yoga": 1531, "brother": 1595, "11am": 1361, "tom": 1486, "ana": 1516, "mother": 1375, "carson": 1425, "downtown_chicago": 1441, "704_el_camino_real": 1340, "pizza_hut": 1522, "465_arcadia_pl": 1591, "four_seasons": 1536, "408_university_ave": 1422, "trader_joes": 1413, "830_almanor_ln": 1493, "tai_pan": 1603, "638_amherst_st": 1401, "sigona_farmers_market": 1592, "the_2nd": 1515, "the_6th": 1502, "the_9th": 1578, "the_18th": 1408, "338_alester_ave": 1303, "midtown_shopping_center": 1473, "347_alta_mesa_ave": 1344, "jills_house": 1511, "436_alger_dr": 1459, "palo_alto_cafe": 1521, "171_oak_rd": 1379, "topanga_mall": 1369, "842_arrowhead_way": 1296, "panda_express": 1392, "783_arcadia_pl": 1398, "chevron": 1440, "864_almanor_ln": 1550, "jacks_house": 1391, "swimming_activity": 1492, "discuss_the_company_picnic": 1472, "sales_team": 1402, "conference_room_102": 1579, "executive_team": 1456, "conference": 1335, "5672_barringer_street": 1311, "10_ames_street": 1507, "113_anton_ct": 1412, "round_table": 1353, "comfort_inn": 1332, "53_university_av": 1529, "shell": 1373, "269_alger_dr": 1418, "cafe_venetia": 1403, "753_university_ave": 1489, "1313_chester_ave": 1457, "hacienda_market": 1520, "880_ames_ct": 1453, "webster_garage": 1446, "56_cadwell_street": 1415, "528_anton_ct": 1548, "pizza_my_heart": 1485, "5677_southwest_4th_street": 1479, "899_ames_ct": 1598, "stanford_childrens_health": 1547, "tennis": 1357, "270_altaire_walk": 1383, "civic_center_garage": 1498, "tennis_activity": 1312, "next_few_days": 1384, "optometrist": 1509, "12th": 1306, "optometrist_appointment": 1455, "8th": 1571, "next_week": 1586, "the_1st": 1331, "discuss_dress_code": 1345, "hr": 1370, "the_20th": 1560, "100_conference_room": 1556, "the_14th": 1372, "8pm": 1409, "discuss_the_merger": 1555, "swimming": 1428, "394_van_ness_ave": 1363, "coupa": 1513, "the_19th": 1558, "cold": 1410, "boss": 1471, "dentist": 1593, "onboard_new_members": 1494, "go_over_quarterly_report": 1582, "14th": 1405, "the_17th": 1514, "weekend": 1434, "infrastructure_team": 1477, "go_over_budget": 1419, "657_ames_ave": 1463, "the_clement_hotel": 1358, "lab": 1309, "7_miles": 1454, "vice_president": 1585, "jack": 1570, "travelers_lodge": 1430, "333_arbol_dr": 1501, "doctor": 1365, "jill": 1424, "next_weekend": 1313, "two_days": 1450, "10th": 1376, "452_arcadia_place": 1596, "next_weeks": 1574, "3rd": 1601, "7th": 1599, "to113_arbol_dr": 1295, "145_amherst_street": 1291, "465_arcadia_place": 1589, "two_day": 1381, "5th": 1503, "53_university_ave": 1299, "coffee_or_tea_places": 1583, "13th": 1427, "4th": 1321, "6th": 1559, "783_arcadia_place": 1362, "go_over_quarterly_reports": 1553, "20th": 1584, "jing_jingcan": 1525, "819_alma_street": 1568, "at270_altaire_walk": 1417, "$GO$": 0}, "rev_mapping": {"237": "the", "610": "nearest", "688": "sketch_poi_type", "132": "is", "787": "sketch_poi", "354": "at", "336": "sketch_address", "903": "would", "332": "you", "522": "like", "1273": "directions", "1120": "there", "1042": "?", "258": "where", "41": "s", "402": "distance", "148": "address", "64": "poi", "1246": "it", "770": "looks", "1112": "a", "846": "road", "541": "block", "813": "being", "877": "reported", "744": "on", "1018": "route", "269": "but", "1093": "i", "549": "will", "477": "still", "703": "find", "904": "quickest", "628": "to", "396": "yes", "443": ",", "62": "please", "550": "set", "768": "via", "919": "that", "568": "avoids", "1003": "all", "1000": "if", "751": "possible", "228": "are", "1078": "very", "130": "welcome", "285": "!", "478": "", "980": "thanks", "418": "so", "1096": "much", "895": "for", "126": "your", "1086": "help", "43": "sketch_distance", "180": "away", "151": "located", "916": "through", "1261": "sketch_traffic_info", "850": "what", "731": "anytime", "710": "closest", "1123": "show", "1167": "me", "116": "location", "40": "can", "102": "get", "1244": "chinese", "1211": "food", "1183": "with", "1165": "only", "373": "noted", "557": "ok", "752": "give", "680": "an", "199": "and", "517": "drive", "685": "safely", "101": "enjoy", "483": "thank", "72": "have", "923": "good", "695": "time", "604": "hi", "581": "up", "60": "reminder", "479": "my", "864": "sketch_event", "1019": "sketch_time", "114": "sketch_party", "208": "who", "608": "date", "537": "party", "1163": "event", "301": "okay", "14": "perfect", "386": "when", "936": "schedule", "430": "put", "173": "calendar", "671": "sketch_date", "1134": "weather", "375": "this", "361": "sketch_weekly_time", "22": "be", "74": "sketch_weather_attribute", "892": "sketch_temperature", "560": "highest", "1047": "day", "606": "check", "198": "forecast", "946": "high", "288": "low", "1281": "sketch_location", "466": "no", "1213": "not", "68": "gonna", "256": "in", "417": "over", "328": "next", "456": "2", "270": "days", "367": "raining", "87": "car", "633": "do", "273": "want", "852": "know", "211": "of", "137": "excellent", "1056": "helpful", "1132": "city", "669": "need", "275": "shopping", "1063": "mall", "316": "reach", "252": "sounds", "170": "great", "756": "setting", "1011": "work", "1271": "sketch_room", "769": "remind", "20": "nearby", "986": "coffee", "282": "shops", "1260": "which", "324": "collision", "476": "try", "723": "take", "634": "fastest", "1146": "available", "271": "four", "1219": "scheduled", "209": ";", "65": "one", "667": "john", "1085": "coming", "547": "room", "422": "agenda", "1186": "should", "759": "going", "876": "expected", "1272": "temperature", "53": "glad", "1133": "could", "189": "assistance", "505": "class", "1040": "kindly", "1179": "right", "103": "now", "457": "shouldn", "649": "t", "755": "any", "1001": "during", "1216": "seven", "11": "scheduling", "590": "pleasure", "1119": "sorry", "698": "appears", "1028": "shortest", "696": "send", "909": "sent", "1195": "map", "49": "pick", "120": "listing", "947": "fast", "1236": "places", "893": "more", "395": "info", "1180": "restaurant", "363": "sure", "956": "pizza", "1250": "place", "260": "within", "663": "ve", "333": "already", "920": "navigator", "143": "go", "6": "nextt", "705": "attending", "868": "shall", "1151": "upcoming", "452": "chance", "686": "problem", "98": "both", "376": "they", "2": "none", "1170": "has", "327": "least", "701": "amount", "887": "traffic", "964": "moment", "1060": "we", "842": "from", "76": "navigation", "219": "keen", "718": "alright", "1203": "way", "1090": "screen", "369": "then", "622": "let", "39": "inquiring", "38": "about", "589": "showing", "1194": "skies", "925": "tell", "493": "medicine", "611": "anything", "1242": "else", "815": "roadblock", "673": "without", "1044": "m", "733": "option", "1025": "range", "467": "around", "873": "slightly", "55": "longer", "578": "allow", "670": "faster", "1266": "house", "267": "does", "782": "friend", "894": "live", "1012": "ll", "1155": "carefully", "48": "listed", "454": "gps", "1045": "desiring", "236": ":", "801": "search", "509": "hotels", "1182": "near", "240": "alternate", "450": "did", "1": "assistant", "433": "make", "1016": "call", "461": "area", "566": "destination", "785": "uhh", "80": "well", "138": "park", "298": "or", "913": "prefer", "571": "actually", "18": "another", "844": "shop", "832": "just", "1168": "two", "939": "miles", "264": "called", "583": "bud", "1267": "details", "111": "add", "540": "discuss", "383": "company", "739": "picnic", "707": "our", "1176": "these", "861": "papa", "406": "tonight", "1175": "4", "1259": "50pm", "586": "attach", "1269": "10", "1243": "minutes", "555": "before", "955": "hand", "319": "3", "845": "say", "480": "specific", "432": "entire", "29": "trip", "773": "predicted", "694": "am", "863": "really", "424": "appointment", "749": "name", "1232": "happy", "677": "lined", "1128": "dad", "1215": "out", "1100": "supposed", "543": "interested", "33": "here", "1030": "position", "225": "pain", "1122": "navigate", "508": "its", "155": "how", "629": "other", "1204": "those", "1009": "quick", "174": "information", "184": "hope", "1279": "too", "1081": "won", "97": "rainy", "229": "been", "154": "see", "325": "aug", "750": "august", "210": "serving", "404": "planned", "1227": "little", "419": "48", "967": "hours", "821": "wide", "998": "conditions", "645": "-", "862": "particular", "754": "weekly", "485": "looking", "352": "wanting", "738": "predicts", "1088": "immediately", "783": "fine", "1249": "predict", "1049": "three", "556": "first", "1206": "last", "778": "goodbye", "140": "hear", "338": "7", "1158": "lows", "96": "20s", "262": "highs", "914": "60", "414": "avoid", "1149": "awesome", "652": "got", "429": "fantastic", "294": "eye", "343": "feel", "573": "some", "722": "closer", "587": "options", "337": "peets", "944": "game", "220": "playing", "687": "tenth", "712": "month", "672": "correct", "226": "sound", "743": "able", "254": "anyway", "784": "direct", "1046": "preferably", "323": "updated", "118": "navigating", "553": "soon", "1202": "fall", "1083": "confirm", "482": "quarterly", "1026": "report", "357": "best", "730": "wish", "881": "otherwise", "415": "isn", "445": "predictions", "960": "several", "927": "cities", "525": "something", "5": "sending", "664": "mmm", "1136": "patience", "599": "note", "659": "oh", "614": "start", "831": "same", "51": "parties", "858": "joining", "765": "named", "436": "night", "917": "sketch_agenda", "554": "future", "1154": "local", "1031": "tea", "283": "current", "23": "fog", "181": "along", "286": "doesn", "235": "sir", "1091": "between", "966": "by", "1209": "few", "207": "providing", "57": "follow", "609": "error", "315": "test", "793": "data", "848": "en", "499": "assitant", "329": "plot", "824": "driver", "440": "update", "1221": "asking", "825": "clear", "54": "couple", "1217": "listings", "511": "eat", "201": "safe", "942": "hotel", "675": "palo", "1214": "alto", "890": "garage", "1147": "stanford", "931": "oval", "714": "chosen", "836": "arrive", "867": "shortly", "510": "prescription", "253": "later", "1233": "pills", "1055": "stay", "503": "suggest", "115": "enter", "1048": "purpose", "1159": "as", "214": "he", "1196": "was", "501": "his", "1111": "business", "971": "meaning", "81": "might", "623": "lose", "347": "lot", "1191": "currently", "760": "wanted", "600": "aware", "19": "guess", "1024": "5671", "145": "barringer", "683": "street", "245": "miss", "889": "most", "442": "fill", "172": "display", "231": "making", "693": "hello", "591": "him", "1142": "bring", "251": "friends", "700": "100fs", "104": "serves", "795": "calls", "1113": "wind", "1278": "bunch", "42": "temperatures", "388": "alternative", "7": "quicker", "1095": "also", "1064": "chicago", "843": "especially", "166": "laboratory", "1109": "request", "941": "discussing", "567": "dress", "83": "code", "465": "results", "1130": "tomorrows", "458": "parking", "1288": "spot", "1053": "though", "221": "locations", "289": "works", "878": "each", "929": "50s", "993": "reaching", "489": "?!", "518": "displaying", "551": "once", "1205": "again", "171": "unfortunately", "59": "different", "234": "don", "1061": "found", "506": "worry", "857": "forget", "869": "remember", "1275": "preference", "1189": "d", "1102": "close", "933": "ravenswood", "75": "104", "248": "thrusday", "377": "done", "1008": "29th", "1241": "outside", "516": "grocery", "215": "market", "702": "ugh", "492": "store", "439": "expect", "530": "testing", "888": "certain", "676": "269", "495": "alger", "185": "visit", "1251": "snowing", "513": "rock", "13": "philzis", "533": "weeks", "779": "afraid", "1094": "pull", "351": "lives", "186": "far", "1177": "enough", "514": "retrieve", "397": "whole", "139": "lessons", "52": "list", "953": "reminders", "484": "mom", "448": "pizzeria", "410": "nope", "317": "highlighted", "912": "lost", "1038": "kidding", "45": "activites", "36": "while", "757": "avoiding", "840": "picked", "934": "assist", "437": "schedules", "100": "signing", "617": "nda", "86": "additional", "655": "needing", "408": "alarm", "370": "locate", "764": "homes", "35": "wrong", "405": "aren", "113": "vary", "320": "40s", "713": "wonderful", "640": "thusday", "798": "atheron", "455": "forecasts", "682": "groceries", "921": "819", "1240": "alma", "502": "dr", "1103": "dinners", "1276": "minimum", "193": "nearer", "994": "bye", "296": "welcone", "353": "directing", "134": "pic", "1235": "cup", "364": "mandarin", "1284": "4f", "859": "shows", "56": "alternately", "182": "buy", "1037": "cool", "874": "ouch", "777": "dates", "820": "needed", "1258": "times", "726": "choice", "775": "childrens", "1245": "less", "427": "presently", "488": "may", "63": "back", "1153": "seems", "642": "finding", "910": "december", "112": "buddy", "1137": "their", "1127": "776", "344": "arastradero", "99": "play", "725": "however", "1114": "confused", "217": "worried", "1041": "l", "995": "o", "1263": "w", "879": "y", "812": "exact", "727": "heading", "965": "recorded", "856": "didn", "127": "ask", "109": "starving", "30": "12pm", "651": "shot", "519": "highlight", "371": "using", "24": "proceed", "494": "tired", "342": "added", "1115": "budget", "981": "snowy", "25": "group", "1105": "look", "772": "probably", "162": "either", "950": "since", "699": "than", "1020": "alrigth", "800": "cafe", "616": "ventia", "1097": "random", "394": "ice", "987": "fastes", "930": "doing", "124": "repetitive", "621": "job", "975": "70fs", "957": "domino", "125": "menlo", "497": "parl", "381": "appreciate", "1222": "use", "471": "exercise", "28": "100", "735": "calling", "970": "50", "243": "outlook", "1052": "full", "205": "practice", "46": "feeling", "989": "care", "71": "00am", "159": "102", "203": "activity", "272": "covers", "1054": "2am", "943": "&", "668": "5", "1107": "reiterate", "190": "events", "804": "takeout", "136": "attendance", "391": "speak", "809": "5672", "241": "direction", "108": "mapping", "58": "exactly", "246": "marked", "761": "taking", "940": "provide", "988": "271", "66": "springer", "1193": "st", "690": "learning", "546": "them", "1106": "closet", "1218": "fact", "105": "im", "392": "son", "882": "nice", "674": "predicting", "520": "happening", "362": "talking", "1033": "choose", "817": "even", "1252": "specifically", "481": "come", "1171": "awful", "594": "wanna", "278": "refill", "638": "helping", "829": "willow", "349": "match", "403": "tho", "719": "locally", "431": "blood", "569": "lowest", "500": "temperture", "654": "434", "572": "arastraero", "720": "desire", "123": "italian", "736": "style", "789": "espresso", "819": "clouds", "985": "although", "1255": "better", "523": "830", "358": "almanor", "823": "lane", "37": "long", "627": "trying", "781": "always", "961": "sleep", "833": "double", "841": "her", "192": "nor", "766": "anyone", "374": "thre", "168": "everything", "716": "short", "366": "plotting", "12": "gas", "224": "calculate", "312": "says", "1059": "prediction", "78": "forecasted", "340": "mix", "1188": ">", "409": "said", "179": "exceptions", "973": "quickly", "1160": "despite", "711": "plan", "1210": "thats", "334": "drizzling", "849": "mean", "660": "placing", "570": "12", "748": "service", "1135": "farther", "305": "requested", "737": "items", "1014": "ready", "1082": "whenever", "277": "10pm", "728": "central", "963": "tooth", "636": "pulled", "1143": "motels", "1145": "22nd", "1075": "50sf", "818": "cloudiness", "266": "states", "1051": "warmest", "472": "starts", "790": "understood", "197": "knowing", "434": "heads", "1225": "seeking", "4": "held", "534": "second", "807": "stereo", "732": "\"", "200": "nothing", "802": "matters", "67": "music", "469": "meantime", "1257": "open", "167": "whats", "928": "executive", "1207": "40", "88": "20", "648": "purchase", "708": "maybe", "444": "coordinates", "885": "startbucks", "1077": "vaccination", "635": "hunger", "990": "reminded", "839": "ahead", "962": "sue", "1208": "empty", "632": "22and", "1265": "blizzards", "1138": "ever", "295": "drizzles", "122": "saurday", "838": "average", "335": "fahrenheit", "1200": "started", "563": "memory", "729": "lesson", "548": "outcast", "291": "pf", "1264": "chans", "355": "seeing", "1139": "together", "470": "rest", "512": "100s", "268": "hailing", "21": "/", "1092": "waste", "1035": "ones", "95": "lighter", "300": "cleat", "678": "sells", "1131": "tueday", "490": "wow", "384": "directionsome", "1283": "third", "972": "sometime", "1148": "trough", "577": "solves", "542": "!\\", "575": "214", "899": "select", "420": ".,", "774": "mist", "1198": "period", "460": "certainly", "1164": "unable", "827": "state", "326": "lunch", "426": "experience", "619": "fairly", "679": "beginning", "161": "end", "73": "warmer", "880": "noooooooo", "1254": "somewhere", "398": "stuck", "991": "relax", "866": "asap", "896": "careful", "84": "9pm", "806": "soonest", "178": ":),", "1072": "mind", "1277": "reports", "828": "doesnt", "1099": "appear", "771": "relevant", "1023": "us", "605": "70s", "70": "medication", "697": "somewhat", "119": "indications", "1274": "30", "891": "many", "830": "cost", "794": "wait", "1199": "329", "1229": "el", "158": "camino", "763": "rea", "255": "climate", "515": "begin", "662": "2opm", "579": "forcast", "297": "marta", "630": "starve", "1197": "because", "665": "trust", "552": "regret", "618": "gasoline", "907": "wold", "206": "jacks", "797": "90s", "984": "followed", "816": "meet", "360": "serve", "1201": "kill", "212": "wirth", "183": "yo", "580": "march", "293": "30s", "9": "hungry", "387": "involved", "498": "promptly", "1087": "clarify", "94": "afternoon", "796": "think", "1178": "phils", "637": "routes", "188": "starbuck", "411": "56", "593": "caldwell", "758": "[", "247": "conversation", "196": "]", "734": "travel", "992": "swim", "1125": "bet", "745": "heavy", "977": "wet", "886": "misspoken", "564": "45", "997": "morning", "524": "whichever", "1050": "trouble", "780": "turn", "299": "watch", "847": "ranges", "1237": "mid", "528": "70", "871": "80s", "1074": "meds", "1181": "games", "345": "wed", "1027": "into", "959": "suffice", "762": "bro", "400": "hour", "661": "neither", "932": "plotted", "31": "traveler", "983": "lodge", "1230": "referring", "650": "mark", "135": "fresco", "133": "routh", "441": "chanel", "870": "vote", "900": "chicken", "647": "orange", "15": "shrimps", "535": "nuts", "382": "july", "160": "saved", "3": "enroute", "142": "program", "902": "children", "799": "health", "263": "foods", "164": "issue", "1129": "pass", "346": "vp", "446": "mine", "602": "greatly", "1238": "include", "612": "eventually", "1126": "dental", "607": "30pm", "507": "accident", "937": "types", "715": "promising", "1239": "moderate", "1039": "amounts", "350": "encounter", "423": "secheduled", "27": "people", "538": "among", "1089": "hai", "905": "wdnesday", "625": "response", "855": "repeat", "531": "frosty", "496": "20fs", "576": "displayed", "348": "advised", "666": "adddress", "1187": "880", "1066": "ames", "786": "whose", "753": "addres", "259": "483", "447": "alester", "249": "ave", "194": "wondering", "792": "coupe", "257": "fun", "721": "mount", "85": "view", "1262": "rsvp", "1118": "responded", "156": "acceptable", "77": "deal", "582": "mostly", "157": "coupas", "1173": "free", "147": "cars", "1192": "123", "1002": "elm", "202": "shoot", "1185": "kind", "303": "hurry", "468": "sunny", "91": "approximately", "359": "shots", "233": "ya", "438": "agree", "746": "seriously", "401": "storms", "681": "goes", "1287": "moms", "491": "april", "232": "2017", "948": "thurs", "82": "receive", "8": "whoever", "976": "lets", "265": "down", "853": "sweet", "860": "session", "1174": "getting", "1079": "nowy", "372": "such", "1280": "plans", "803": "00pm", "1073": "falling", "592": "lots", "865": "heard", "565": "driving", "656": "864", "684": "alamanor", "1010": "given", "901": "searched", "389": "instead", "558": "welcoem", "413": "programmed", "1015": "picking", "1005": "above", "641": "86", "459": "degrees", "1021": "impending", "539": "course", "834": "san", "313": "fancisco", "390": "sensibly", "1068": "lower", "646": "coldest", "653": "westin", "304": "giving", "1234": "finally", "1231": "listening", "16": "hit", "281": "mappling", "1101": "somehow", "814": "million", "974": "head", "117": "likely", "596": "carefull", "230": "reached", "969": "super", "875": "hhumid", "238": "suday", "1256": "171", "1162": "oak", "176": "reservations", "449": "load", "1029": "classes", "32": "anyt", "311": "towards", "146": "60s", "191": "storming", "883": "merger", "1220": "accomplish", "1067": "fasest", "615": "yor", "144": "putting", "968": "sit", "1043": "drink", "93": "fasted", "996": "big", "1108": "apple", "626": "guide", "1223": "783", "935": "arcadia", "149": "pi", "1069": "storm", "504": "must", "742": "drunk", "128": "traveling", "280": "series", "1270": "ups", "1172": "downs", "475": "confirmed", "747": "22th", "473": "iniglewood", "908": "coffe", "292": "rather", "574": "express", "69": "p", "1013": "f", "689": "chang", "532": "gather", "153": "slight", "365": "trader", "150": "joe", "822": "wild", "631": "news", "982": "joint", "1084": "347", "854": "alta", "1247": "mesa", "308": "further", "1117": "5677", "624": "southwest", "897": "evening", "724": "checking", "474": "standford", "639": "648", "1034": "amherst", "603": "ahlambra", "1076": "=", "1098": "private", "309": "radio", "131": "rhank", "741": "chances", "545": "scattered", "129": "including", "306": "barista", "808": "downtown", "658": "(", "227": ").", "44": "respectively", "529": "helps", "1036": "potential", "110": "workout", "915": "1", "1057": "satisfy", "393": "system", "487": "previsions", "906": "love", "152": "malls", "951": "liked", "26": "identical", "1224": "ingelwood", "331": "human", "463": "90", "1286": "bathroom", "811": "!!", "851": "altherton", "318": "massage", "239": "seat", "1150": "broken", "223": "activate", "407": "uff", "421": ")", "1169": "headed", "585": "closeest", "1152": "463", "165": "wil", "657": "gathering", "244": "pronto", "1190": "reporting", "218": "slow", "1228": "hacienda", "451": "insert", "1248": "invited", "356": "jing", "938": "jang", "34": "having", "704": "new", "92": "loved", "1022": "yelp", "559": "welsome", "999": "you1", "321": "panda", "767": "chef", "805": "chu", "643": "detours", "1006": "avalible", "898": "preferred", "339": "needs", "613": "scedule", "213": "90fs", "486": "changing", "1166": "pulling", "17": "distracted", "216": "focus", "884": "probability", "562": "regarding", "872": "actual", "89": "possibly", "314": "everyday", "706": "except", "826": "ive", "740": "teh", "121": "running", "918": "choices", "1161": "dicu", "597": "until", "1007": "nooo", "958": "clothes", "1141": "amazing", "644": "removed", "380": "adding", "561": "mountianview", "776": "wearther", "261": "varies", "322": "adress", "379": "whom", "791": "includes", "378": "areas", "284": "produce", "544": "stand", "385": "probem", "453": "n", "464": "man", "412": "warn", "187": "satruday", "692": "terrific", "141": "jones", "106": "contain", "287": "follows", "709": "ranging", "526": "reservation", "175": "boys", "368": "girl", "341": "dose", "428": "original", "163": "ther", "588": "run", "435": "maping", "1253": "jong", "1140": "tio", "169": "valeros", "1268": "accompanying", "1184": "chrildrens", "945": "of20f", "595": "heat", "1157": "\",", "691": "beside", "584": "\\", "922": "bad", "10": "office", "61": "point", "279": "person", "1065": "pm", "717": "thankyou", "924": "multiple", "302": "),", "954": "sort", "911": "gover", "399": "reserve", "416": "made", "1124": "mainly", "204": "daughter", "107": "understand", "274": "reminding", "1080": "11", "1226": "9", "195": "00", "979": "extremely", "1058": "shown", "1144": "ravenwood", "1070": "drom", "1071": "traders", "527": "fastesr", "1121": "present", "620": "infrastructure", "1110": "keep", "1116": "eyes", "1062": "....", "307": "light", "90": "feed", "810": "siri", "1004": "replace", "949": "8", "79": "speed", "952": "fair", "521": "calender", "276": "humidity", "1285": "cloud", "290": "cover", "926": "collison", "536": "delay", "310": "arrival", "1156": "following", "425": "restaraunt", "177": "plese", "462": "woud", "222": "$STOP$", "50": "$PAD$", "601": "$UNK$", "835": "$TAG$", "47": "$u", "1017": "$s", "242": "$1", "788": "$1", "598": "$2", "330": "$2", "978": "$3", "837": "$3", "1104": "$4", "1212": "$4", "250": "$5", "1032": "$5", "1282": "$6", "1567": "parking_garage", "1437": "dish_parking", "1487": "550_alester_ave", "1551": "2_miles", "1538": "traffic_info", "1317": "road_block_nearby", "1602": "poi_type", "1549": "6_miles", "1330": "no_traffic", "1380": "610_amarillo_ave", "1512": "stanford_oval_parking", "1387": "4_miles", "1590": "car_collision_nearby", "1533": "grocery_store", "1406": "409_bollard_st", "1467": "willows_market", "1600": "moderate_traffic", "1530": "rest_stop", "1535": "329_el_camino_real", "1327": "the_westin", "1328": "1_miles", "1594": "heavy_traffic", "1569": "friends_house", "1322": "580_van_ness_ave", "1438": "toms_house", "1461": "pizza_restaurant", "1407": "915_arbol_dr", "1338": "pizza_chicago", "1351": "gas_station", "1386": "200_alester_ave", "1350": "valero", "1388": "chinese_restaurant", "1301": "271_springer_street", "1449": "mandarin_roots", "1354": "76", "1561": "shopping_center", "1504": "383_university_ave", "1468": "town_and_country", "1374": "91_el_camino_real", "1442": "773_alger_dr", "1495": "stanford_shopping_center", "1348": "3_miles", "1304": "coffee_or_tea_place", "1293": "145_amherst_st", "1452": "teavana", "1426": "776_arastradero_rd", "1416": "dominos", "1307": "481_amaranta_ave", "1334": "palo_alto_garage_r", "1396": "5_miles", "1320": "hospital", "1339": "214_el_camino_real", "1475": "stanford_express_care", "1300": "611_ames_ave", "1324": "palo_alto_medical_foundation", "1439": "p_._f_._changs", "1460": "669_el_camino_real", "1532": "434_arastradero_rd", "1359": "ravenswood_shopping_center", "1575": "8_miles", "1316": "593_arrowhead_way", "1390": "chef_chu_s", "1542": "home", "1385": "5671_barringer_street", "1337": "583_alester_ave", "1474": "philz", "1444": "dinner", "1294": "the_11th", "1404": "4pm", "1604": "sister", "1433": "7pm", "1510": "jon", "1319": "the_8th", "1465": "aunt", "1443": "dentist_appointment", "1368": "10am", "1540": "saturday", "1302": "marie", "1587": "taking_medicine", "1564": "5pm", "1352": "monday", "1314": "alex", "1480": "football_activity", "1490": "the_4th", "1464": "yoga_activity", "1496": "the_13th", "1526": "father", "1481": "lab_appointment", "1423": "sunday", "1411": "2pm", "1342": "week", "1518": "hail", "1580": "rain", "1378": "thursday", "1541": "lowest_temperature", "1429": "20f", "1544": "90f", "1341": "hot", "1356": "new_york", "1519": "weather_attribute", "1577": "stormy", "1484": "70f", "1435": "manhattan", "1343": "50f", "1543": "tuesday", "1588": "cloudy", "1382": "40f", "1297": "wednesday", "1488": "clear_skies", "1355": "60f", "1310": "friday", "1466": "windy", "1508": "snow", "1572": "30f", "1527": "overcast", "1447": "camarillo", "1483": "100f", "1329": "frost", "1497": "80f", "1476": "blizzard", "1326": "dry", "1289": "menlo_park", "1395": "warm", "1333": "foggy", "1421": "corona", "1366": "seattle", "1399": "drizzle", "1377": "grand_rapids", "1318": "danville", "1451": "misty", "1298": 