{"vocab_mapping": {"there": 347, "are": 334, "no": 306, "restaurants": 202, "that": 61, "serve": 705, "cantonese": 130, "food": 126, "in": 364, "the": 745, "sketch_pricerange": 255, "price": 129, "range": 386, ".": 504, "i": 56, "am": 752, "looking": 29, "for": 621, "a": 637, "restaurant": 522, "is": 456, "moderately": 124, "priced": 742, "and": 394, "serves": 179, "api_call": 90, "sketch_food": 180, "dontcare": 248, "how": 371, "about": 128, "type": 445, "of": 145, "?": 576, "sketch_name": 277, "would": 538, "you": 105, "like": 536, "their": 327, "location": 291, "<silence>": 295, "name": 586, "address": 409, "area": 360, "phone": 743, "pricerange": 634, "postcode": 352, "number": 698, "sketch_phone": 282, "please": 719, "it": 647, "located": 220, "sketch_area": 648, "part": 354, "town": 305, "what": 330, "goodbye": 410, "thank": 263, "your": 308, "help": 554, "good": 588, "bye": 516, "records": 577, "matching": 31, "request": 125, "an": 32, "serving": 407, "australian": 233, "may": 438, "find": 185, "different": 594, "hello": 9, ",": 761, "six": 91, "query": 690, "one": 5, "them": 561, "anything": 332, "else": 444, "can": 726, "with": 242, "01223352500": 511, "could": 512, "have": 548, "thanks": 702, "wanting": 137, "offers": 528, "where": 40, "see": 120, "two": 483, "might": 526, "work": 368, "but": 28, "id": 498, "to": 450, "offer": 349, "closest": 674, "city": 602, "do": 672, "not": 292, "care": 262, "sounds": 488, "so": 158, "ring": 539, "'re": 278, "welcome": 374, "great": 433, "!": 725, "side": 110, "more": 535, "information": 65, "does": 720, "they": 484, "at": 108, "sketch_address": 749, "yes": 227, "business": 707, "welconme": 499, "everything": 451, "need": 455, "meet": 395, "specification": 629, "other": 420, "which": 759, "prefer": 564, "place": 190, "give": 593, "me": 657, "'s": 377, "01223351707.": 247, "will": 46, "be": 192, "want": 11, "or": 272, "n't": 603, "awesome": 730, "sorry": 391, "world": 688, "found": 191, "provide": 384, "something": 398, "'d": 212, "options": 454, "regarding": 764, "today": 72, "goobye": 59, "several": 58, "matches": 590, "this": 457, "here": 177, "go": 342, "wait": 738, "welsh": 73, "meets": 582, "criteria": 240, "let": 152, "know": 543, "21-24": 79, "northampton": 668, "road": 604, "any": 346, "get": 411, "another": 635, "steakhouse": 541, "change": 610, "four": 689, "option": 44, "preference": 385, "on": 537, "numbers": 19, "okay": 76, "nice": 563, "day": 605, "five": 546, "kind": 611, "sound": 716, "sketch_postcode": 239, "send": 609, "very": 671, "much": 566, "nine": 14, "tell": 481, "'m": 24, "afraid": 257, "chiquito": 405, "again": 547, "possible": 642, "classy": 701, "108": 737, "looks": 109, "my": 353, "database": 302, "scottish": 328, "were": 337, "first": 569, "all": 520, "addresses": 578, "additional": 237, "info": 618, "using": 33, "our": 495, "service": 89, "its": 168, "suggest": 6, "restraunt": 84, "results": 77, "eatery": 213, "cherry": 653, "hinton": 393, "fit": 733, "bill": 768, "cambridge": 476, "system": 728, "three": 553, "cuisine": 628, "dont": 453, "finding": 617, "description": 735, "try": 36, "searching": 288, "hey": 235, "if": 500, "panasian": 675, "ok.": 119, "check": 529, "post": 706, "code": 15, "as": 370, "well": 147, "either": 545, "fine": 189, "thier": 558, "resteraunt": 571, "available": 22, "1223": 216, "462354": 316, "desired": 530, "english": 222, "both": 138, "selection": 415, "places": 615, "did": 226, "certain": 531, "mind": 63, "listed": 763, "catalan": 174, "reached": 517, "those": 207, "evening": 183, "enjoy": 286, "meal": 654, "too": 753, "c.b": 700, "2": 42, "1.d": 513, "p": 229, "recommend": 264, "interested": 616, "right": 667, "now": 47, "listings": 681, "reach": 55, "contact": 265, "cuban": 144, "called": 20, "quite": 309, "course": 695, "205": 412, "victoria": 685, "chesterton": 122, "street": 324, "also": 41, "apologies": 387, "ids": 149, "choosing": 276, "grafton": 310, "hotel": 562, "619": 721, "assist": 585, "traditional": 413, "only": 111, "fitting": 355, "such": 143, "14": 153, "-": 313, "16": 85, "bridge": 447, "sure": 261, "cost": 404, "popular": 399, "further": 336, "assistance": 421, "having": 209, "return": 231, "inquiries": 198, "center": 579, "most": 132, "ok": 414, "call": 127, "questions": 195, "01223360966.": 573, "jamaican": 166, "nearby": 419, "telephone": 365, "tuscan": 12, "hi": 596, "expensively": 329, "choices": 359, "alimentum": 722, "some": 301, "end": 708, "stay": 325, "category": 245, "specific": 568, "past": 623, "many": 326, "differnt": 139, "types": 383, "unfortuntately": 94, "search": 154, "appeals": 485, "currently": 699, "talking": 230, "austrian": 200, "5": 52, "32": 427, "perfect": 673, "requests": 472, "asian": 300, "oriental": 219, "particular": 114, "excellent": 157, "01223247877": 17, "appreciate": 86, "fits": 102, "venetian": 709, "c": 534, "b": 612, "25": 592, "9": 426, "q.": 458, "areas": 583, "really": 441, "desire": 676, "01223351880": 135, "20": 170, "milton": 524, "unfortunately": 376, "brazilian": 88, "second": 279, "ca": 442, "swedish": 82, "look": 283, "style": 162, "increase": 555, "these": 101, "interest": 740, "calling": 49, "us": 649, "use": 677, "th": 734, "following": 315, ":": 16, "should": 43, "then": 492, "'ll": 479, "take": 159, "ciquito": 691, "bar": 679, "locdated": 496, "290": 744, "wonderful": 21, "mid": 665, "long": 117, "instead": 493, "'ve": 267, "actually": 98, "had": 205, "bad": 13, "experience": 468, "gold": 93, "wok": 523, "few": 473, "diverse": 712, "anywhere": 598, "huh": 491, "hate": 477, "somewhere": 515, "far": 670, "away": 250, "matter": 581, "suggestions": 299, "100": 431, "choose": 662, "from": 422, "served": 266, "by": 461, "01223727410": 747, "think": 466, "happy": 270, "dine": 358, "tasty": 51, "needed": 260, "establishment": 527, "come": 632, "back": 750, "ya": 474, "upscale": 71, "specify": 369, "delicious": 416, "canapes": 717, "restaraunt": 378, "irish": 298, "modern": 713, "pricing": 666, "inexpensive": 490, "choise": 39, "within": 430, "categories": 251, "problem": 186, "specifications": 218, "need..": 465, "reasonably": 574, "01223350688": 243, "night": 113, "malaysian": 175, "expand": 253, "moderatre": 97, "danish": 570, "3qf": 74, "we": 70, "hungarian": 194, "creative": 341, "sir": 181, "oh": 449, "needs": 141, "show": 379, "inquiry": 518, "01223400170.": 268, "preferred": 223, "just": 508, "certainly": 146, "eat": 241, "however": 608, "already": 323, "got": 284, "caribbean": 165, "venues": 684, "venue": 92, "seve": 622, "christmas": 293, "has": 403, "169": 87, "high": 489, "suits": 550, "was": 661, "restaraunts": 351, "whichever": 335, "better": 627, "im": 375, "up": 718, "whats": 459, "around": 525, "hope": 572, "thing": 297, "out": 3, "8": 727, "eritrean": 494, "01223351707": 625, "recommended": 766, "01223366552.": 140, "01223568988": 503, "medium": 161, "specializes": 215, "parameters": 509, "017-335-3355": 614, "average": 601, "dish": 53, "tnahh": 81, "binh": 67, "pardon": 246, "01223367660": 273, "malasian": 397, "resturants": 142, "elese": 281, "make": 197, "suggestion": 80, "singaporean": 155, "singapore": 532, "bistro": 448, "qualifications": 357, "settle": 633, "01223302010.": 401, "contacting": 296, "match": 201, "ranges": 38, "dining": 736, "wanted": 274, "3": 626, "none": 506, "84": 151, "shiraz": 234, "eastern": 131, "postal": 392, "anymore": 380, "each": 133, "australasian": 338, ";": 597, "preferences": 37, "01223350688.": 462, "alternatively": 640, "kosher": 475, "features": 607, "menu": 172, "01223": 480, "301030": 78, "seems": 692, "basque": 406, "nope": 136, "locations": 434, "require": 204, "names": 320, "vegetarian": 96, "narrow": 658, "down": 760, "'": 486, "f": 478, "yummy": 636, "22": 361, "c.b.1": 244, "7": 173, "d.y": 606, "southern": 115, "while": 595, "fulfill": 417, "thank-you": 467, "giving": 317, "someone": 27, "believe": 715, "prices": 487, "greek": 425, "queries": 164, "been": 680, "severing": 687, "american": 106, "mill": 697, "restaurnt": 10, "01223311053.": 521, "expinsive": 652, "unusual": 339, "hmm": 463, "...": 104, "moroccan": 225, "persian": 156, "10": 163, "others": 505, "sytem": 57, "3-34": 452, "saint": 178, "andrews": 340, "restuarants": 319, "woluld": 350, "exist": 510, "apologize": 514, "4": 704, "3.h": 221, "l": 176, "next": 54, "1.uy": 584, "nirala": 214, "fusion": 645, "moderatly": 630, "bummer": 23, "dbye": 331, "direct": 519, "hang": 187, "pricey": 756, "under": 25, "$": 34, "25.00": 258, "per": 99, "entree": 559, "polish": 66, "recommendations": 502, "same": 432, "rated": 150, "01223248882.": 112, "15": 402, "scandinavian": 367, "suppose": 95, "requested": 600, "barbeque": 655, "provided": 275, "romanian": 236, "bbq": 589, "nothing": 575, "mathcing": 641, "russian": 471, "showing": 656, "made": 549, "mistake": 497, "list": 663, "restarant": 428, "01223566388": 754, "swiss": 68, "wecome": 693, "trying": 363, "ones": 767, "therea": 312, "meeting": 280, "crossover": 711, "sitar": 356, "tandoon": 443, "restuarant": 196, "..good": 436, "wide": 678, "variety": 303, "definitely": 587, "seem": 460, "broaden": 429, "indonesian": 2, "ten": 211, "asked": 322, "peking": 643, "belgian": 683, "absolutely": 18, "01223327908.": 228, "lot": 26, "tanh": 446, "along": 285, "time": 748, "towards": 580, "important": 254, "than": 35, "280": 169, "spend": 100, "money": 206, "afghan": 540, "requirement": 389, "german": 729, "plus": 542, "glad": 644, "regent": 557, "appear": 249, "goo": 741, "fact": 171, "halal": 48, "least": 372, "river": 710, "4-6": 651, "rose": 64, "crescent": 208, "moderatley": 167, "preferably": 193, "that'it": 599, "pleasure": 294, "varying": 423, "varisty": 307, "35": 232, "sanit": 321, "offering": 769, "dinner": 304, "24": 646, "green": 482, "particularly": 118, "best": 390, "lovely": 62, "52": 620, "directions": 396, "third": 619, "152-154": 696, "hills": 333, "01223413000": 45, "probably": 75, "total": 714, "01223307581": 69, "resaurants": 638, "ant": 732, "1": 134, "d": 50, "y": 160, "convenient": 269, "secondary": 435, "choice": 116, "moment": 373, "hit": 259, "maybe": 664, "listing": 345, "takes": 762, "01223352500.": 290, "covered": 60, "meant": 123, "01223362525": 439, "visit": 751, "woah": 560, "corsica": 203, "selling": 252, "6": 552, "west.would": 567, "going": 408, "alternate": 184, "hear": 348, "result": 694, "centr": 343, "01223308681": 739, "good-bye": 424, "lucky": 501, "star": 686, "server": 556, "shot": 238, "restauant": 469, ">": 650, "still": 107, "alright": 551, "01223812660": 287, "nah": 103, "whatever": 210, "cool": 83, "although": 199, "requirements": 418, "head": 624, "perform": 724, "priced..": 470, "clarify": 148, "correct": 400, "01223315232.": 755, "17": 1, "59": 318, "trouble": 182, "deciding": 565, "tonight": 464, "139": 746, "atmosphere": 311, "fairly": 507, "named": 660, "tow": 7, "c.b2": 314, "u.f": 289, "locate": 121, "entries": 440, "works": 533, "restrauant": 30, "01223307030.": 613, "toward": 591, "thinking": 682, "mid-range": 723, "01799521260": 271, "$STOP$": 631, "$PAD$": 639, "$UNK$": 4, "$TAG$": 669, "$u": 382, "$s": 344, "$1": 659, "$2": 544, "$3": 765, "$4": 381, "$5": 256, "$6": 757, "$7": 8, "$8": 224, "$9": 758, "moderate": 1056, "chinese": 916, "golden_wok": 1067, "jinling_noodle_bar": 915, "11_peas_hill_city_centre": 1012, "centre": 1024, "01223_566188": 1125, "cb23pp": 836, "lan_hong_house": 1118, "12_norfolk_street_city_centre": 952, "01223_350420": 1132, "cb12lf": 970, "191_histon_road_chesterton": 1083, "north": 851, "01223_350688": 825, "cb43hl": 907, "shanghai_family_restaurant": 1071, "39_burleigh_street_city_centre": 847, "01223_301761": 784, "cb11dg": 917, "expensive": 1080, "british": 996, "travellers_rest": 1161, "fitzbillies_restaurant": 856, "51_trumpington_street_city_centre": 980, "01223_352500": 772, "cb21rg": 1114, "graffiti": 782, "hotel_felix_whitehouse_lane_huntingdon_road": 881, "west": 1018, "01223_277977": 1070, "cb30lx": 991, "grafton_hotel_restaurant": 1019, "grafton_hotel_619_newmarket_road_fen_ditton": 1094, "east": 812, "01223_241387": 1030, "cb58pa": 896, "huntingdon_road_city_centre": 886, "01223_276182": 821, "cb30df": 875, "the_cambridge_chop_house": 1068, "1_kings_parade": 987, "01223_359506": 1050, "cb21sj": 1186, "midsummer_house_restaurant": 854, "midsummer_common": 940, "01223_369299": 976, "cb41ha": 1090, "african": 942, "bedouin": 1144, "100_mill_road_city_centre": 978, "01223_367660": 890, "cb12bd": 950, "the_nirala": 960, "7_milton_road_chesterton": 776, "indian": 837, "01223_360966": 982, "cb41uy": 882, "italian": 1105, "cheap": 1147, "da_vinci_pizzeria": 1034, "20_milton_road_chesterton": 794, "01223_351707": 1112, "cb41jy": 1081, "curry_prince": 811, "451_newmarket_road_fen_ditton": 1180, "01223_566388": 872, "cb58jj": 1157, "pizza_hut_fen_ditton": 1181, "cambridge_retail_park_newmarket_road_fen_ditton": 948, "01223_323737": 831, "cb58wr": 1102, "rajmahal": 1126, "7_barnwell_road_fen_ditton": 1025, "01223_244955": 1027, "cb58rg": 1182, "pipasha_restaurant": 918, "sitar_tandoori": 985, "newmarket_road_fen_ditton": 1149, "01223_577786": 865, "43_high_street_cherry_hinton_cherry_hinton": 1016, "01223_249955": 967, "cb19hx": 1079, "gastropub": 840, "01223_248882": 926, "529_newmarket_road_fen_ditton": 1163, "yu_garden": 880, "meghna": 1187, "prezzo": 1057, "21_-_24_northampton_road": 866, "01799_521260": 842, "cb30ad": 1086, "saint_johns_chop_house": 901, "21_-_24_northampton_street": 1033, "01223_353110": 814, "205_victoria_road_chesterton": 1022, "01223_727410": 905, "cb43lf": 1000, "restaurant_one_seven": 914, "de_vere_university_arms_regent_street_city_centre": 945, "01223_337766": 870, "cb21ab": 1046, "the_oak_bistro": 920, "6_lensfield_road": 861, "01223_323361": 921, "cb21eg": 863, "the_copper_kettle": 869, "4_kings_parade_city_centre": 1171, "01223_365068": 852, "cotto": 781, "183_east_road_city_centre": 939, "01223_302010": 1092, "cb11bg": 1003, "south": 1135, "the_good_luck_chinese_food_takeaway": 963, "82_cherry_hinton_road_cherry_hinton": 1042, "01223_244149": 953, "cb17ag": 1010, "pizza_hut_cherry_hinton": 1124, "g4_cambridge_leisure_park_clifton_way_cherry_hinton": 1183, "cb17dy": 1055, "taj_tandoori": 1131, "64_cherry_hinton_road_cherry_hinton": 1117, "01223_412299": 935, "cb17aa": 936, "restaurant_alimentum": 819, "152_-_154_hills_road": 903, "modern_european": 904, "01223_413000": 809, "cb28pb": 899, "chiquito_restaurant_bar": 1084, "2g_cambridge_leisure_park_cherry_hinton_road_cherry_hinton": 1064, "mexican": 975, "01223_400170": 969, "nandos": 1023, "cambridge_leisure_park_clifton_way": 846, "portuguese": 1123, "01223_327908": 906, "the_lucky_star": 1043, "cambridge_leisure_park_clifton_way_cherry_hinton": 1097, "01223_244277": 1172, "peking_restaurant": 938, "10_homerton_street_city_centre": 1138, "01223_354755": 998, "cb28nx": 1038, "frankie_and_bennys": 1093, "01223_412430": 990, "korean": 1134, "little_seoul": 947, "108_regent_street_city_centre": 1103, "01223_308681": 1085, "cb21dp": 979, "regent_street_city_centre": 877, "cocum": 1062, "01223_366668": 828, "tandoori_palace": 1017, "68_histon_road_chesterton": 974, "01223_506055": 1128, "cb43le": 1169, "71_castle_street_city_centre": 932, "cb30ah": 927, "rice_boat": 973, "37_newnham_road_newnham": 815, "01223_302800": 1082, "cb39ey": 871, "maharajah_tandoori_restaurant": 1184, "41518_castle_street_city_centre": 999, "01223_358399": 1176, "india_house": 855, "31_newnham_road_newnham": 1127, "01223_461661": 955, "la_margherita": 1136, "thanh_binh": 850, "vietnamese": 848, "17_magdalene_street_city_centre": 930, "01223_362456": 925, "cb30af": 795, "15_magdalene_street_city_centre": 1007, "01223_315232": 1006, "thai": 885, "bangkok_city": 770, "24_green_street_city_centre": 1004, "01223_354382": 934, "cb23jx": 1013, "royal_spice": 933, "victoria_avenue_chesterton": 1164, "01733_553355": 888, "cb41eh": 1146, "spanish": 1111, "la_tasca": 1160, "01223_464630": 1158, "14_-16_bridge_street": 1104, "cb21uf": 1065, "japanese": 1051, "wagamama": 1119, "36_saint_andrews_street": 803, "01223_462354": 977, "cb23ar": 1148, "european": 1166, "galleria": 1156, "hotel_du_vin_and_bistro": 909, "15_-_19_trumpington_street": 860, "01223_227330": 792, "cb21qa": 929, "33_bridge_street": 798, "01223_362054": 1145, "cb21uw": 1109, "turkish": 1029, "anatolia": 779, "meze_bar_restaurant": 845, "196_mill_road_city_centre": 1002, "cb13nf": 889, "30_bridge_street_city_centre": 822, "01223_362372": 807, "cb21uj": 1150, "efes_restaurant": 983, "king_street_city_centre": 913, "01223_500005": 796, "cb11ln": 793, "french": 1011, "restaurant_two_two": 805, "22_chesterton_road_chesterton": 988, "01223_351880": 1139, "cb43ax": 1115, "royal_standard": 1154, "290_mill_road_city_centre": 1179, "01223_247877": 838, "cb13nl": 1167, "international": 839, "the_varsity_restaurant": 1047, "35_saint_andrews_street_city_centre": 922, "01223_356060": 981, "bloomsbury_restaurant": 968, "crowne_plaza_hotel_20_downing_street": 833, "0871_942_9180": 800, "cb23dt": 849, "kohinoor": 827, "74_mill_road_city_centre": 797, "01223_323639": 1009, "cb12as": 1175, "the_gandhi": 820, "72_regent_street_city_centre": 1108, "01223_353942": 1165, "mahal_of_cambridge": 774, "3_-_5_millers_yard_mill_lane": 1130, "01223_360409": 853, "cb21rq": 1122, "cambridge_lodge_restaurant": 789, "eraina": 816, "free_school_lane_city_centre": 1106, "01223_368786": 824, "cb23rh": 1044, "michaelhouse_cafe": 1100, "st._michael's_church_trinity_street_city_centre": 887, "01223_309147": 1074, "cb21su": 1078, "cambridge_lodge_hotel_139_huntingdon_road_city_centre": 829, "01223_355166": 919, "cb30dq": 771, "the_missing_sock": 937, "01223_812660": 1075, "cb259aq": 1020, "finders_corner_newmarket_road": 801, "pizza_hut_city_centre": 1099, "ask": 874, "12_bridge_street_city_centre": 893, "01223_364917": 1049, "zizzi_cambridge": 924, "47-53_regent_street": 894, "01223_365599": 1140, "mediterranean": 1120, "the_gardenia": 954, "2_rose_crescent_city_centre": 1152, "01223_356354": 832, "cb23ll": 1143, "nandos_city_centre": 923, "33-34_saint_andrews_street": 1063, "seafood": 1170, "loch_fyne": 892, "the_little_rose_37_trumpington_street": 964, "01223_362433": 788, "cb21qy": 1121, "pizza_express": 876, "01223_324033": 1058, "cb21db": 790, "de_luca_cucina_and_bar": 783, "83_regent_street": 1039, "01223_356666": 867, "cb21aw": 879, "riverside_brasserie": 844, "doubletree_by_hilton_cambridge_granta_place_mill_lane": 1098, "01223_259988": 1133, "cb21rt": 780, "ali_baba": 1026, "59_hills_road_city_centre": 1153, "lebanese": 864, "01462_432565": 843, "cb21nt": 873, "yippee_noodle_bar": 841, "40428_king_street_city_centre": 1185, "asian_oriental": 994, "01223_518111": 810, "cb11lh": 1101, "the_cow_pizza_kitchen_and_bar": 949, "corn_exchange_street": 858, "01223_308871": 1089, "cb23qf": 941, "pizza_express_fen_ditton": 1014, "jesus_lane_fen_ditton": 972, "cb58ba": 823, "caffe_uno": 951, "bridge_street_city_centre": 908, "01223_448620": 1008, "stazione_restaurant_and_coffee_bar": 946, "market_hill_city_centre": 931, "01223_352607": 1069, "cb23nj": 1178, "clowns_cafe": 1001, "54_king_street_city_centre": 1036, "01223_355711": 1052, "don_pasquale_pizzeria": 958, "12_market_hill_city_centre": 1137, "01223_350106": 884, "32_bridge_street_city_centre": 1035, "dojo_noodle_bar": 995, "01223_363471": 1129, "40210_millers_yard_city_centre": 1174, "j_restaurant": 1032, "86_regent_street_city_centre": 992, "01223_307581": 895, "kymmoy": 830, "saigon_city": 787, "169_high_street_chesterton_chesterton": 883, "01223_356555": 962, "cb41nl": 777, "52_mill_road_city_centre": 1059, "01223_311911": 943, "cote": 1096, "01223_311053": 1173, "backstreet_bistro": 862, "2_sturton_street_city_centre": 1151, "01223_306306": 971, "mill_road_city_centre": 778, "la_raza": 984, "4_-_6_rose_crescent": 1076, "01223_464550": 898, "curry_garden": 1142, "106_regent_street_city_centre": 965, "01223_302330": 804, "cb12qa": 785, "darrys_cookhouse_and_wine_shop": 802, "40270_king_street_city_centre": 1113, "01223_505015": 817, "the_golden_curry": 1072, "01223_329432": 1110, "cb12az": 859, "ugly_duckling": 1005, "12_st._johns_street_city_centre": 944, "cb21tw": 959, "hakka": 1095, "milton_road_chesterton": 986, "01223_568988": 775, "saffron_brasserie": 834, "hills_road_city_centre": 989, "01223_354679": 1088, "cb21la": 1045, "la_mimosa": 1116, "thompsons_lane_fen_ditton": 1031, "01223_362525": 835, "cb58aq": 902, "sala_thong": 818, "35_newnham_road_newnham": 791, "01223_323178": 857, "city_stop_restaurant": 1040, "cambridge_city_football_club_milton_road_chesterton": 808, "01223_363270": 910, "the_hotpot": 956, "66_chesterton_road_chesterton": 826, "01223_366552": 1107, "cb41ep": 786, "panahar": 1054, "8_norfolk_street_city_centre": 1087, "01223_355012": 961, "tang_chinese": 1053, "napier_street_city_centre": 799, "01223_357187": 1048, "cb11hr": 806, "the_slug_and_lettuce": 1155, "34_-_35_green_street": 1177, "cb23ju": 1188, "curry_king": 773, "5_jordans_yard_bridge_street_city_centre": 928, "01223_324351": 1037, "cb21ug": 1159, "curry_queen": 891, "106_mill_road_city_centre": 1091, "01223_351027": 1141, "hk_fusion": 897, "21_burleigh_street_city_centre": 1168, "01223_355909": 1061, "gourmet_burger_kitchen": 1041, "north_american": 1077, "01223_312598": 911, "shiraz_restaurant": 813, "84_regent_street_city_centre": 957, "sesame_restaurant_and_bar": 993, "17_hills_road_city_centre": 1060, "01223_358899": 1066, "cb21nw": 868, "charlie_chan": 1015, "01223_361763": 912, "the_river_bar_steakhouse_and_grill": 1162, "quayside_off_bridge_street": 1189, "01223_307030": 900, "rice_house": 1073, "88_mill_road_city_centre": 878, "01223_367755": 1028, "golden_house": 1021, "12_lensfield_road_city_centre": 1190, "01842_753771": 966, "efes_restaurants": 997, "$GO$": 0}, "rev_mapping": {"347": "there", "334": "are", "306": "no", "202": "restaurants", "61": "that", "705": "serve", "130": "cantonese", "126": "food", "364": "in", "745": "the", "255": "sketch_pricerange", "129": "price", "386": "range", "504": ".", "56": "i", "752": "am", "29": "looking", "621": "for", "637": "a", "522": "restaurant", "456": "is", "124": "moderately", "742": "priced", "394": "and", "179": "serves", "90": "api_call", "180": "sketch_food", "248": "dontcare", "371": "how", "128": "about", "445": "type", "145": "of", "576": "?", "277": "sketch_name", "538": "would", "105": "you", "536": "like", "327": "their", "291": "location", "295": "<silence>", "586": "name", "409": "address", "360": "area", "743": "phone", "634": "pricerange", "352": "postcode", "698": "number", "282": "sketch_phone", "719": "please", "647": "it", "220": "located", "648": "sketch_area", "354": "part", "305": "town", "330": "what", "410": "goodbye", "263": "thank", "308": "your", "554": "help", "588": "good", "516": "bye", "577": "records", "31": "matching", "125": "request", "32": "an", "407": "serving", "233": "australian", "438": "may", "185": "find", "594": "different", "9": "hello", "761": ",", "91": "six", "690": "query", "5": "one", "561": "them", "332": "anything", "444": "else", "726": "can", "242": "with", "511": "01223352500", "512": "could", "548": "have", "702": "thanks", "137": "wanting", "528": "offers", "40": "where", "120": "see", "483": "two", "526": "might", "368": "work", "28": "but", "498": "id", "450": "to", "349": "offer", "674": "closest", "602": "city", "672": "do", "292": "not", "262": "care", "488": "sounds", "158": "so", "539": "ring", "278": "'re", "374": "welcome", "433": "great", "725": "!", "110": "side", "535": "more", "65": "information", "720": "does", "484": "they", "108": "at", "749": "sketch_address", "227": "yes", "707": "business", "499": "welconme", "451": "everything", "455": "need", "395": "meet", "629": "specification", "420": "other", "759": "which", "564": "prefer", "190": "place", "593": "give", "657": "me", "377": "'s", "247": "01223351707.", "46": "will", "192": "be", "11": "want", "272": "or", "603": "n't", "730": "awesome", "391": "sorry", "688": "world", "191": "found", "384": "provide", "398": "something", "212": "'d", "454": "options", "764": "regarding", "72": "today", "59": "goobye", "58": "several", "590": "matches", "457": "this", "177": "here", "342": "go", "738": "wait", "73": "welsh", "582": "meets", "240": "criteria", "152": "let", "543": "know", "79": "21-24", "668": "northampton", "604": "road", "346": "any", "411": "get", "635": "another", "541": "steakhouse", "610": "change", "689": "four", "44": "option", "385": "preference", "537": "on", "19": "numbers", "76": "okay", "563": "nice", "605": "day", "546": "five", "611": "kind", "716": "sound", "239": "sketch_postcode", "609": "send", "671": "very", "566": "much", "14": "nine", "481": "tell", "24": "'m", "257": "afraid", "405": "chiquito", "547": "again", "642": "possible", "701": "classy", "737": "108", "109": "looks", "353": "my", "302": "database", "328": "scottish", "337": "were", "569": "first", "520": "all", "578": "addresses", "237": "additional", "618": "info", "33": "using", "495": "our", "89": "service", "168": "its", "6": "suggest", "84": "restraunt", "77": "results", "213": "eatery", "653": "cherry", "393": "hinton", "733": "fit", "768": "bill", "476": "cambridge", "728": "system", "553": "three", "628": "cuisine", "453": "dont", "617": "finding", "735": "description", "36": "try", "288": "searching", "235": "hey", "500": "if", "675": "panasian", "119": "ok.", "529": "check", "706": "post", "15": "code", "370": "as", "147": "well", "545": "either", "189": "fine", "558": "thier", "571": "resteraunt", "22": "available", "216": "1223", "316": "462354", "530": "desired", "222": "english", "138": "both", "415": "selection", "615": "places", "226": "did", "531": "certain", "63": "mind", "763": "listed", "174": "catalan", "517": "reached", "207": "those", "183": "evening", "286": "enjoy", "654": "meal", "753": "too", "700": "c.b", "42": "2", "513": "1.d", "229": "p", "264": "recommend", "616": "interested", "667": "right", "47": "now", "681": "listings", "55": "reach", "265": "contact", "144": "cuban", "20": "called", "309": "quite", "695": "course", "412": "205", "685": "victoria", "122": "chesterton", "324": "street", "41": "also", "387": "apologies", "149": "ids", "276": "choosing", "310": "grafton", "562": "hotel", "721": "619", "585": "assist", "413": "traditional", "111": "only", "355": "fitting", "143": "such", "153": "14", "313": "-", "85": "16", "447": "bridge", "261": "sure", "404": "cost", "399": "popular", "336": "further", "421": "assistance", "209": "having", "231": "return", "198": "inquiries", "579": "center", "132": "most", "414": "ok", "127": "call", "195": "questions", "573": "01223360966.", "166": "jamaican", "419": "nearby", "365": "telephone", "12": "tuscan", "596": "hi", "329": "expensively", "359": "choices", "722": "alimentum", "301": "some", "708": "end", "325": "stay", "245": "category", "568": "specific", "623": "past", "326": "many", "139": "differnt", "383": "types", "94": "unfortuntately", "154": "search", "485": "appeals", "699": "currently", "230": "talking", "200": "austrian", "52": "5", "427": "32", "673": "perfect", "472": "requests", "300": "asian", "219": "oriental", "114": "particular", "157": "excellent", "17": "01223247877", "86": "appreciate", "102": "fits", "709": "venetian", "534": "c", "612": "b", "592": "25", "426": "9", "458": "q.", "583": "areas", "441": "really", "676": "desire", "135": "01223351880", "170": "20", "524": "milton", "376": "unfortunately", "88": "brazilian", "279": "second", "442": "ca", "82": "swedish", "283": "look", "162": "style", "555": "increase", "101": "these", "740": "interest", "49": "calling", "649": "us", "677": "use", "734": "th", "315": "following", "16": ":", "43": "should", "492": "then", "479": "'ll", "159": "take", "691": "ciquito", "679": "bar", "496": "locdated", "744": "290", "21": "wonderful", "665": "mid", "117": "long", "493": "instead", "267": "'ve", "98": "actually", "205": "had", "13": "bad", "468": "experience", "93": "gold", "523": "wok", "473": "few", "712": "diverse", "598": "anywhere", "491": "huh", "477": "hate", "515": "somewhere", "670": "far", "250": "away", "581": "matter", "299": "suggestions", "431": "100", "662": "choose", "422": "from", "266": "served", "461": "by", "747": "01223727410", "466": "think", "270": "happy", "358": "dine", "51": "tasty", "260": "needed", "527": "establishment", "632": "come", "750": "back", "474": "ya", "71": "upscale", "369": "specify", "416": "delicious", "717": "canapes", "378": "restaraunt", "298": "irish", "713": "modern", "666": "pricing", "490": "inexpensive", "39": "choise", "430": "within", "251": "categories", "186": "problem", "218": "specifications", "465": "need..", "574": "reasonably", "243": "01223350688", "113": "night", "175": "malaysian", "253": "expand", "97": "moderatre", "570": "danish", "74": "3qf", "70": "we", "194": "hungarian", "341": "creative", "181": "sir", "449": "oh", "141": "needs", "379": "show", "518": "inquiry", "268": "01223400170.", "223": "preferred", "508": "just", "146": "certainly", "241": "eat", "608": "however", "323": "already", "284": "got", "165": "caribbean", "684": "venues", "92": "venue", "622": "seve", "293": "christmas", "403": "has", "87": "169", "489": "high", "550": "suits", "661": "was", "351": "restaraunts", "335": "whichever", "627": "better", "375": "im", "718": "up", "459": "whats", "525": "around", "572": "hope", "297": "thing", "3": "out", "727": "8", "494": "eritrean", "625": "01223351707", "766": "recommended", "140": "01223366552.", "503": "01223568988", "161": "medium", "215": "specializes", "509": "parameters", "614": "017-335-3355", "601": "average", "53": "dish", "81": "tnahh", "67": "binh", "246": "pardon", "273": "01223367660", "397": "malasian", "142": "resturants", "281": "elese", "197": "make", "80": "suggestion", "155": "singaporean", "532": "singapore", "448": "bistro", "357": "qualifications", "633": "settle", "401": "01223302010.", "296": "contacting", "201": "match", "38": "ranges", "736": "dining", "274": "wanted", "626": "3", "506": "none", "151": "84", "234": "shiraz", "131": "eastern", "392": "postal", "380": "anymore", "133": "each", "338": "australasian", "597": ";", "37": "preferences", "462": "01223350688.", "640": "alternatively", "475": "kosher", "607": "features", "172": "menu", "480": "01223", "78": "301030", "692": "seems", "406": "basque", "136": "nope", "434": "locations", "204": "require", "320": "names", "96": "vegetarian", "658": "narrow", "760": "down", "486": "'", "478": "f", "636": "yummy", "361": "22", "244": "c.b.1", "173": "7", "606": "d.y", "115": "southern", "595": "while", "417": "fulfill", "467": "thank-you", "317": "giving", "27": "someone", "715": "believe", "487": "prices", "425": "greek", "164": "queries", "680": "been", "687": "severing", "106": "american", "697": "mill", "10": "restaurnt", "521": "01223311053.", "652": "expinsive", "339": "unusual", "463": "hmm", "104": "...", "225": "moroccan", "156": "persian", "163": "10", "505": "others", "57": "sytem", "452": "3-34", "178": "saint", "340": "andrews", "319": "restuarants", "350": "woluld", "510": "exist", "514": "apologize", "704": "4", "221": "3.h", "176": "l", "54": "next", "584": "1.uy", "214": "nirala", "645": "fusion", "630": "moderatly", "23": "bummer", "331": "dbye", "519": "direct", "187": "hang", "756": "pricey", "25": "under", "34": "$", "258": "25.00", "99": "per", "559": "entree", "66": "polish", "502": "recommendations", "432": "same", "150": "rated", "112": "01223248882.", "402": "15", "367": "scandinavian", "95": "suppose", "600": "requested", "655": "barbeque", "275": "provided", "236": "romanian", "589": "bbq", "575": "nothing", "641": "mathcing", "471": "russian", "656": "showing", "549": "made", "497": "mistake", "663": "list", "428": "restarant", "754": "01223566388", "68": "swiss", "693": "wecome", "363": "trying", "767": "ones", "312": "therea", "280": "meeting", "711": "crossover", "356": "sitar", "443": "tandoon", "196": "restuarant", "436": "..good", "678": "wide", "303": "variety", "587": "definitely", "460": "seem", "429": "broaden", "2": "indonesian", "211": "ten", "322": "asked", "643": "peking", "683": "belgian", "18": "absolutely", "228": "01223327908.", "26": "lot", "446": "tanh", "285": "along", "748": "time", "580": "towards", "254": "important", "35": "than", "169": "280", "100": "spend", "206": "money", "540": "afghan", "389": "requirement", "729": "german", "542": "plus", "644": "glad", "557": "regent", "249": "appear", "741": "goo", "171": "fact", "48": "halal", "372": "least", "710": "river", "651": "4-6", "64": "rose", "208": "crescent", "167": "moderatley", "193": "preferably", "599": "that'it", "294": "pleasure", "423": "varying", "307": "varisty", "232": "35", "321": "sanit", "769": "offering", "304": "dinner", "646": "24", "482": "green", "118": "particularly", "390": "best", "62": "lovely", "620": "52", "396": "directions", "619": "third", "696": "152-154", "333": "hills", "45": "01223413000", "75": "probably", "714": "total", "69": "01223307581", "638": "resaurants", "732": "ant", "134": "1", "50": "d", "160": "y", "269": "convenient", "435": "secondary", "116": "choice", "373": "moment", "259": "hit", "664": "maybe", "345": "listing", "762": "takes", "290": "01223352500.", "60": "covered", "123": "meant", "439": "01223362525", "751": "visit", "560": "woah", "203": "corsica", "252": "selling", "552": "6", "567": "west.would", "408": "going", "184": "alternate", "348": "hear", "694": "result", "343": "centr", "739": "01223308681", "424": "good-bye", "501": "lucky", "686": "star", "556": "server", "238": "shot", "469": "restauant", "650": ">", "107": "still", "551": "alright", "287": "01223812660", "103": "nah", "210": "whatever", "83": "cool", "199": "although", "418": "requirements", "624": "head", "724": "perform", "470": "priced..", "148": "clarify", "400": "correct", "755": "01223315232.", "1": "17", "318": "59", "182": "trouble", "565": "deciding", "464": "tonight", "746": "139", "311": "atmosphere", "507": "fairly", "660": "named", "7": "tow", "314": "c.b2", "289": "u.f", "121": "locate", "440": "entries", "533": "works", "30": "restrauant", "613": "01223307030.", "591": "toward", "682": "thinking", "723": "mid-range", "271": "01799521260", "631": "$STOP$", "639": "$PAD$", "4": "$UNK$", "669": "$TAG$", "382": "$u", "344": "$s", "703": "$1", "659": "$1", "388": "$2", "544": "$2", "731": "$3", "765": "$3", "188": "$4", "381": "$4", "366": "$5", "256": "$5", "217": "$6", "757": "$6", "437": "$7", "8": "$7", "362": "$8", "224": "$8", "758": "$9", "1056": "moderate", "916": "chinese", "1067": "golden_wok", "915": "jinling_noodle_bar", "1012": "11_peas_hill_city_centre", "1024": "centre", "1125": "01223_566188", "836": "cb23pp", "1118": "lan_hong_house", "952": "12_norfolk_street_city_centre", "1132": "01223_350420", "970": "cb12lf", "1083": "191_histon_road_chesterton", "851": "north", "825": "01223_350688", "907": "cb43hl", "1071": "shanghai_family_restaurant", "847": "39_burleigh_street_city_centre", "784": "01223_301761", "917": "cb11dg", "1080": "expensive", "996": "british", "1161": "travellers_rest", "856": "fitzbillies_restaurant", "980": "51_trumpington_street_city_centre", "772": "01223_352500", "1114": "cb21rg", "782": "graffiti", "881": "hotel_felix_whitehouse_lane_huntingdon_road", "1018": "west", "1070": "01223_277977", "991": "cb30lx", "1019": "grafton_hotel_restaurant", "1094": "grafton_hotel_619_newmarket_road_fen_ditton", "812": "east", "1030": "01223_241387", "896": "cb58pa", "886": "huntingdon_road_city_centre", "821": "01223_276182", "875": "cb30df", "1068": "the_cambridge_chop_house", "987": "1_kings_parade", "1050": "01223_359506", "1186": "cb21sj", "854": "midsummer_house_restaurant", "940": "midsummer_common", "976": "01223_369299", "1090": "cb41ha", "942": "african", "1144": "bedouin", "978": "100_mill_road_city_centre", "890": "01223_367660", "950": "cb12bd", "960": "the_nirala", "776": "7_milton_road_chesterton", "837": "indian", "982": "01223_360966", "882": "cb41uy", "1105": "italian", "1147": "cheap", "1034": "da_vinci_pizzeria", "794": "20_milton_road_chesterton", "1112": "01223_351707", "1081": "cb41jy", "811": "curry_prince", "1180": "451_newmarket_road_fen_ditton", "872": "01223_566388", "1157": "cb58jj", "1181": "pizza_hut_fen_ditton", "948": "cambridge_retail_park_newmarket_road_fen_ditton", "831": "01223_323737", "1102": "cb58wr", "1126": "rajmahal", "1025": "7_barnwell_road_fen_ditton", "1027": "01223_244955", "1182": "cb58rg", "918": "pipasha_restaurant", "985": "sitar_tandoori", "1149": "newmarket_road_fen_ditton", "865": "01223_577786", "1016": "43_high_street_cherry_hinton_cherry_hinton", "967": "01223_249955", "1079": "cb19hx", "840": "gastropub", "926": "01223_248882", "1163": "529_newmarket_road_fen_ditton", "880": "yu_garden", "1187": "meghna", "1057": "prezzo", "866": "21_-_24_northampton_road", "842": "01799_521260", "1086": "cb30ad", "901": "saint_johns_chop_house", "1033": "21_-_24_northampton_street", "814": "01223_353110", "1022": "205_victoria_road_chesterton", "905": "01223_727410", "1000": "cb43lf", "914": "restaurant_one_seven", "945": "de_vere_university_arms_regent_street_city_centre", "870": "01223_337766", "1046": "cb21ab", "920": "the_oak_bistro", "861": "6_lensfield_road", "921": "01223_323361", "863": "cb21eg", "869": "the_copper_kettle", "1171": "4_kings_parade_city_centre", "852": "01223_365068", "781": "cotto", "939": "183_east_road_city_centre", "1092": "01223_302010", "1003": "cb11bg", "1135": "south", "963": "the_good_luck_chinese_food_takeaway", "1042": "82_cherry_hinton_road_cherry_hinton", "953": "01223_244149", "1010": "cb17ag", "1124": "pizza_hut_cherry_hinton", "1183": "g4_cambridge_leisure_park_clifton_way_cherry_hinton", "1055": "cb17dy", "1131": "taj_tandoori", "1117": "64_cherry_hinton_road_cherry_hinton", "935": "01223_412299", "936": "cb17aa", "819": "restaurant_alimentum", "903": "152_-_154_hills_road", "904": "modern_european", "809": "01223_413000", "899": "cb28pb", "1084": "chiquito_restaurant_bar", "1064": "2g_cambridge_leisure_park_cherry_hinton_road_cherry_hinton", "975": "mexican", "969": "01223_400170", "1023": "nandos", "846": "cambridge_leisure_park_clifton_way", "1123": "portuguese", "906": "01223_327908", "1043": "the_lucky_star", "1097": "cambridge_leisure_park_clifton_way_cherry_hinton", "1172": "01223_244277", "938": "peking_restaurant", "1138": "10_homerton_street_city_centre", "998": "01223_354755", "1038": "cb28nx", "1093": "frankie_and_bennys", "990": "01223_412430", "1134": "korean", "947": "little_seoul", "1103": "108_regent_street_city_centre", "1085": "01223_308681", "979": "cb21dp", "877": "regent_street_city_centre", "1062": "cocum", "828": "01223_366668", "1017": "tandoori_palace", "974": "68_histon_road_chesterton", "1128": "01223_506055", "1169": "cb43le", "932": "71_castle_street_city_centre", "927": "cb30ah", "973": "rice_boat", "815": "37_newnham_road_newnham", "1082": "01223_302800", "871": "cb39ey", "1184": "maharajah_tandoori_restaurant", "999": "41518_castle_street_city_centre", "1176": "01223_358399", "855": "india_house", "1127": "31_newnham_road_newnham", "955": "01223_461661", "1136": "la_margherita", "850": "thanh_binh", "848": "vietnamese", "930": "17_magdalene_street_city_centre", "925": "01223_362456", "795": "cb30af", "1007": "15_magdalene_street_city_centre", "1006": "01223_315232", "885": "thai", "770": "bangkok_city", "1004": "24_green_street_city_centre", "934": "01223_354382", "1013": "cb23jx", "933": "royal_spice", "1164": "victoria_avenue_chesterton", "888": "01733_553355", "1146": "cb41eh", "1111": "spanish", "1160": "la_tasca", "1158": "01223_464630", "1104": "14_-16_bridge_street", "1065": "cb21uf", "1051": "japanese", "1119": "wagamama", "803": "36_saint_andrews_street", "977": "01223_462354", "1148": "cb23ar", "1166": "european", "1156": "galleria", "909": "hotel_du_vin_and_bistro", "860": "15_-_19_trumpington_street", "792": "01223_227330", "929": "cb21qa", "798": "33_bridge_street", "1145": "01223_362054", "1109": "cb21uw", "1029": "turkish", "779": "anatolia", "845": "meze_bar_restaurant", "1002": "196_mill_road_city_centre", "889": "cb13nf", "822": "30_bridge_street_city_centre", "807": "01223_362372", "1150": "cb21uj", "983": "efes_restaurant", "913": "king_street_city_centre", "796": "01223_500005", "793": "cb11ln", "1011": "french", "805": "restaurant_two_two", "988": "22_chesterton_road_chesterton", "1139": "01223_351880", "1115": "cb43ax", "1154": "royal_standard", "1179": "290_mill_road_city_centre", "838": "01223_247877", "1167": "cb13nl", "839": "international", "1047": "the_varsity_restaurant", "922": "35_saint_andrews_street_city_centre", "981": "01223_356060", "968": "bloomsbury_restaurant", "833": "crowne_plaza_hotel_20_downing_street", "800": "0871_942_9180", "849": "cb23dt", "827": "kohinoor", "797": "74_mill_road_city_centre", "1009": "01223_323639", "1175": "cb12as", "820": "the_gandhi", "1108": "72_regent_street_city_centre", "1165": "01223_353942", "774": "mahal_of_cambridge", "1130": "3_-_5_millers_yard_mill_lane", "853": "01223_360409", "1122": "cb21rq", "789": "cambridge_lodge_restaurant", "816": "eraina", "1106": "free_school_lane_city_centre", "824": "01223_368786", "1044": "cb23rh", "1100": "michaelhouse_cafe", "887": "st._michael's_church_trinity_street_city_centre", "1074": "01223_309147", "1078": "cb21su", "829": "cambridge_lodge_hotel_139_huntingdon_road_city_centre", "919": "01223_355166", "771": "cb30dq", "937": "the_missing_sock", "1075": "01223_812660", "1020": "cb259aq", "801": "finders_corner_newmarket_road", "1099": "pizza_hut_city_centre", "874": "ask", "893": "12_bridge_street_city_centre", "1049": "01223_364917", "924": "zizzi_cambridge", "894": "47-53_regent_street", "1140": "01223_365599", "1120": "mediterranean", "954": "the_gardenia", "1152": "2_rose_crescent_city_centre", "832": "01223_356354", "1143": "cb23ll", "923": "nandos_city_centre", "1063": "33-34_saint_andrews_street", "1170": "seafood", "892": "loch_fyne", "964": "the_little_rose_37_trumpington_street", "788": "01223_362433", "1121": "cb21qy", "876": "pizza_express", "1058": "01223_324033", "790": "cb21db", "783": "de_luca_cucina_and_bar", "1039": "83_regent_street", "867": "01223_356666", "879": "cb21aw", "844": "riverside_brasserie", "1098": "doubletree_by_hilton_cambridge_granta_place_mill_lane", "1133": "01223_259988", "780": "cb21rt", "1026": "ali_baba", "1153": "59_hills_road_city_centre", "864": "lebanese", "843": "01462_432565", "873": "cb21nt", "841": "yippee_noodle_bar", "1185": "40428_king_street_city_centre", "994": "asian_oriental", "810": "01223_518111", "1101": "cb11lh", "949": "the_cow_pizza_kitchen_and_bar", "858": "corn_exchange_street", "1089": "01223_308871", "941": "cb23qf", "1014": "pizza_express_fen_ditton", "972": "jesus_lane_fen_ditton", "823": "cb58ba", "951": "caffe_uno", "908": "bridge_street_city_centre", "1008": "01223_448620", "946": "stazione_restaurant_and_coffee_bar", "931": "market_hill_city_centre", "1069": "01223_352607", "1178": "cb23nj", "1001": "clowns_cafe", "1036": "54_king_street_city_centre", "1052": "01223_355711", "958": "don_pasquale_pizzeria", "1137": "12_market_hill_city_centre", "884": "01223_350106", "1035": "32_bridge_street_city_centre", "995": "dojo_noodle_bar", "1129": "01223_363471", "1174": "40210_millers_yard_city_centre", "1032": "j_restaurant", "992": "86_regent_street_city_centre", "895": "01223_307581", "830": "kymmoy", "787": "saigon_city", "883": "169_high_street_chesterton_chesterton", "962": "01223_356555", "777": "cb41nl", "1059": "52_mill_road_city_centre", "943": "01223_311911", "1096": "cote", "1173": "01223_311053", "862": "backstreet_bistro", "1151": "2_sturton_street_city_centre", "971": "01223_306306", "778": "mill_road_city_centre", "984": "la_raza", "1076": "4_-_6_rose_crescent", "898": "01223_464550", "1142": "curry_garden", "965": "106_regent_street_city_centre", "804": "01223_302330", "785": "cb12qa", "802": "darrys_cookhouse_and_wine_shop", "1113": "40270_king_street_city_centre", "817": "01223_505015", "1072": "the_golden_curry", "1110": "01223_329432", "859": "cb12az", "1005": "ugly_duckling", "944": "12_st._johns_street_city_centre", "959": "cb21tw", "1095": "hakka", "986": "milton_road_chesterton", "775": "01223_568988", "834": "saffron_brasserie", "989": "hills_road_city_centre", "1088": "01223_354679", "1045": "cb21la", "1116": "la_mimosa", "1031": "thompsons_lane_fen_ditton", "835": "01223_362525", "902": "cb58aq", "818": "sala_thong", "791": "35_newnham_road_newnham", "857": "01223_323178", "1040": "city_stop_restaurant", "808": "cambridge_city_football_club_milton_road_chesterton", "910": "01223_363270", "956": "the_hotpot", "826": "66_chesterton_road_chesterton", "1107": "01223_366552", "786": "cb41ep", "1054": "panahar", "1087": "8_norfolk_street_city_centre", "961": "01223_355012", "1053": "tang_chinese", "799": "napier_street_city_centre", "1048": "01223_357187", "806": "cb11hr", "1155": "the_slug_and_lettuce", "1177": "34_-_35_green_street", "1188": "cb23ju", "773": "curry_king", "928": "5_jordans_yard_bridge_street_city_centre", "1037": "01223_324351", "1159": "cb21ug", "891": "curry_queen", "1091": "106_mill_road_city_centre", "1141": "01223_351027", "897": "hk_fusion", "1168": "21_burleigh_street_city_centre", "1061": "01223_355909", "1041": "gourmet_burger_kitchen", "1077": "north_american", "911": "01223_312598", "813": "shiraz_restaurant", "957": "84_regent_street_city_centre", "993": "sesame_restaurant_and_bar", "1060": "17_hills_road_city_centre", "1066": "01223_358899", "868": "cb21nw", "1015": "charlie_chan", "912": "01223_361763", "1162": "the_river_bar_steakhouse_and_grill", "1189": "quayside_off_bridge_street", "900": "01223_307030", "1073": "rice_house", "878": "88_mill_road_city_centre", "1028": "01223_367755", "1021": "golden_house", "1190": "12_lensfield_road_city_centre", "966": "01842_753771", "997": "efes_restaurants", "0": "$GO$"}, "unk_mapping": {"section": 1191, "abou": 1225, "464630.": 1235, "servies": 1236, "loated": 1240, ".cb21ab": 1226, "11": 1202, "full": 1203, "01223727410.": 1206, "job": 1248, "less": 1207, "couple": 1247, "epensive": 1210, "near": 1218, "closer": 1222, "services": 1242, "pretty": 1197, "because": 1239, "special": 1215, "occasion": 1228, "01223462354.": 1237, "details": 1220, "selections": 1245, "ood": 1204, "charlie_chan-": 1200, "restauarnt": 1194, "pipasha": 1199, "eateries": 1208, "system..good": 1209, "able": 1230, "ther": 1227, "01223353110": 1250, "196": 1221, "servers": 1234, "town.is": 1195, "anythig": 1243, "hungry": 1224, "01223400170": 1233, "int": 1198, "he": 1219, "shall": 1211, "yo": 1246, "fish": 1214, "chips": 1256, "downtown": 1196, "01223302010": 1257, "sort": 1255, "servings": 1229, "costs": 1232, "amount": 1217, "rest": 1251, "whether": 1205, "appears": 1253, "difficulty": 1212, "anyone": 1241, "nearest": 1223, "resturant": 1216, "multiple": 1213, "01223311053": 1238, "postode": 1254, "iscb259aq": 1201, "01223327908": 1231, "01223323178": 1252, "consider": 1193, "1,2": 1192, "q.a": 1244, "line": 1249}, "rev_unk_mapping": {"1191": "section", "1225": "abou", "1235": "464630.", "1236": "servies", "1240": "loated", "1226": ".cb21ab", "1202": "11", "1203": "full", "1206": "01223727410.", "1248": "job", "1207": "less", "1247": "couple", "1210": "epensive", "1218": "near", "1222": "closer", "1242": "services", "1197": "pretty", "1239": "because", "1215": "special", "1228": "occasion", "1237": "01223462354.", "1220": "details", "1245": "selections", "1204": "ood", "1200": "charlie_chan-", "1194": "restauarnt", "1199": "pipasha", "1208": "eateries", "1209": "system..good", "1230": "able", "1227": "ther", "1250": "01223353110", "1221": "196", "1234": "servers", "1195": "town.is", "1243": "anythig", "1224": "hungry", "1233": "01223400170", "1198": "int", "1219": "he", "1211": "shall", "1246": "yo", "1214": "fish", "1256": "chips", "1196": "downtown", "1257": "01223302010", "1255": "sort", "1229": "servings", "1232": "costs", "1217": "amount", "1251": "rest", "1205": "whether", "1253": "appears", "1212": "difficulty", "1241": "anyone", "1223": "nearest", "1216": "resturant", "1213": "multiple", "1238": "01223311053", "1254": "postode", "1201": "iscb259aq", "1231": "01223327908", "1252": "01223323178", "1193": "consider", "1192": "1,2", "1244": "q.a", "1249": "line"}, "input_vocab_size": 1191, "generate_vocab_size": 770, "output_vocab_size": 1191, "total_copy_vocab_size": 1258}